{
	"version": "https://jsonfeed.org/version/1",
	"title": "Brian Herriot, Fast Follow Investor",
	"icon": "https://micro.blog/brianh/avatar.jpg",
	"home_page_url": "https://fastfollowinvestor.com/",
	"feed_url": "https://fastfollowinvestor.com/feed.json",
	"items": [
		
			{
				"id": "http://brianh.micro.blog/2023/02/13/this-is-my.html",
				"title": "This is my recipe for creating great wealth with little stress.",
				"content_html": "<p><em>I offer my thesis, the &ldquo;Idols Framework for wealth creation&rdquo;, for your review. Calling for 25% Buffett, 25% Walton, 25% Bogle, and 25% Thorpe, it&rsquo;s a recipe for you to absorb, adopt, and adapt.</em>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>I have refined my formula for smart wealth creation in the last five years. Is it a secret formula? No. Is it prescriptive or one-size-fits-all? No, and no.</p>\n<p>But, the formula has merit. And I wish I had known it earlier. The Idols Framework is foundational. With it in place, I can enjoy the adventure of life.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"enjoyable-stress-free-wealth-accumulation\">Enjoyable, stress-free wealth accumulation</h2>\n<p>You can determine the value of your time by calculating your earnings per hour worked. It makes sense to hire out jobs costing less than this measure. Unless you enjoy the job for other reasons (a hobby, for instance)&hellip;</p>\n<p>Successful individuals like <a href=\"https://fastfollowinvestor.com/2023/02/02/consider-studying-notable.html\">Ed Thorpe</a> drive the measure higher: What is the most money you could earn for the least amount of work?</p>\n<p>My variation on personal <em>earnings per hour</em> adjusts the factors slightly.</p>\n<ol>\n<li>Instead of <em>earnings</em>, I&rsquo;m interested in <em>wealth</em>.</li>\n<li>I redefine <em>time spent (per hour)</em> to <em>stress-level</em>.</li>\n</ol>\n<p>My measure becomes <em>wealth created per stress endured</em>. The goal is a high score.</p>\n<p>Two scenarios produce a high score:</p>\n<ol>\n<li>&ldquo;The Bezos&rdquo; This is extreme wealth with significant stress. The high score is due to a large wealth factor.</li>\n<li>&ldquo;The Vagabond&rdquo; This is modest, even minimal wealth, with near zero stress. The high score can be attributed to a small stress factor.</li>\n</ol>\n<p>If I had to pick one, I prefer &ldquo;The Vagabond&rdquo;. Stress is real, and it shortens lives. In the end, all we have is time.  Also, does extreme wealth make us happier?!</p>\n<p>But, I&rsquo;m shooting for somewhere in the middle. Likely, we all are. We would like <em>enough</em> wealth accumulated for the least stress. (<em>Enough</em> means financially independent.)</p>\n<p>How then?\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"idols-framework-for-wealth-creation\">Idols Framework for wealth creation</h2>\n<p>We will create wealth using the Idols Framework. It is a loose business and investment portfolio that I will dissect in great detail in future posts. For now, know that the Idols Framework starts with equal parts Buffett, Walton, Bogle, and Thorpe:</p>\n<ul>\n<li>25% Warren Buffett, of Berkshire Hathaway fame [<strong>margin of safety</strong>]</li>\n<li>25% Sam Walton, from Walmart [<strong>micro-business</strong>]</li>\n<li>25% John Bogle, founder of Vanguard [<strong>buy &amp; hold indexing</strong>]</li>\n<li>25% <a href=\"https://fastfollowinvestor.com/2023/02/02/consider-studying-notable.html\">Ed Thorpe</a>, math genius who beat Vegas and Wall Street [<strong>quantitative trend</strong>]</li>\n</ul>\n<p>The prerequisite to employing the Idols Framework is simple. You must be great (top quartile) at two or more skills that you combine to provide unique value to a niche market.</p>\n<p>The perfect example is Scott Adams, cartoonist. He combined his skills of 1) drawing 2) comedy and 3) corporate experience to produce the successful &ldquo;Dilbert&rdquo; cartoon series. <a href=\"https://dilbertblog.typepad.com/the_dilbert_blog/2007/07/career-advice.html\">Here</a> is his take.</p>\n<p>Early in life, you will build your skills and also your <strong>margin of safety</strong>. Also called an emergency fund, this is the Buffett slice of the Idols Framework. It provides work flexibility.</p>\n<p>Later, use this money to be opportunistic. With it, you can take advantage of major market declines (black swan events). Buy when everyone else is selling.</p>\n<p>Next, create a <strong>micro-business</strong>. Walton is the second slice, but not because Walmart is so giant. I choose <a href=\"https://pod.link/founders/episode/0d9ae711909cea651afe820cb7a9eb00\">Walton</a> to emulate because he&rsquo;s claimed he didn&rsquo;t create anything original. Sam Walton learned his best ideas from others. Then, he combined and aligned the ideas with his vision.</p>\n<p>I love this fact because it means <em>anyone</em> can start a business. Keep it very small (micro) to maintain sole control. Then, you alone can steer the business to low-stress waters.</p>\n<p>Real estate investment makes me anxious. I fear waking from a deep slumber to replace toilets in the middle of the night. But many disagree with me. Small-scale real estate investment also qualifies as a micro-business. In fact, I&rsquo;m advising my son to buy two four-plexes early in life.</p>\n<p>At last, the Bogle and Thorpe slices work together to compound your savings. I invest in two Vanguard index funds: 60% in VTI (US) and 40% in VXUS (non-US). These percentages align with the market capitalization of the world stock market.</p>\n<p>The Idols Framework&rsquo;s last slice is my <a href=\"https://fastfollowinvestor.com/invest-like-me/\">Fast Follow Investor</a> strategy. It replicates <strong>quantitative trend</strong> models built on Ed Thorpe’s early work. The strategy provides deep diversification alongside market-based, passive, <strong>buy &amp; hold indexing</strong> (VTI/ VXUS).</p>\n<p>These investment models need no investment expertise. But you must stay diligent. This is easier said than done. In fact, it&rsquo;s the human side of investing that is the most difficult.</p>\n<p>One can practice a level-headed temperament with good planning, habit-building, and support. I write a lot about <a href=\"https://fastfollowinvestor.com/2023/01/30/the-great-one.html\">this</a>.</p>\n<p>I list the four slices of the Idols framework at 25% each, but percentages do vary for me. And they will for you. In fact, they <em>should</em> flex as you move through life. They will vary based on life stage, the economy, and when opportunities or risks present themselves.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"putting-it-all-together\">Putting it all together</h2>\n<p>Now, let&rsquo;s revisit our <em>wealth created per stress endured</em> measure. We achieve a high score by accumulating <em>enough</em> wealth with very little stress:</p>\n<ul>\n<li>The Bogle and Thorpe investment models are proven and mindless to use.</li>\n<li>With Walton, you stay small (micro!) and navigate your work life as you see fit.</li>\n<li>And Buffett&rsquo;s margin of safety provides additional padding&hellip; so you can &ldquo;be greedy when others are fearful&rdquo;.</li>\n</ul>\n<p>Great wealth with little stress. Magic.</p>\n<blockquote>\n<p>Follow the Idols Framework to run a self-directed, micro-business with cash on hand to take advantage of undervalued assets all the while producing high investment returns that are fully diversified.</p>\n</blockquote>\n<p>That sentence is long. But, I&rsquo;ll keep this post short. I have so much more to share. Please stay tuned.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p><a href=\"https://fastfollowinvestor.com/subscribe/\">Subscribe</a> to get my posts sent to your Inbox.</p>\n",
				"content_text": "_I offer my thesis, the \"Idols Framework for wealth creation\", for your review. Calling for 25% Buffett, 25% Walton, 25% Bogle, and 25% Thorpe, it's a recipe for you to absorb, adopt, and adapt._\n<n>\n<n>\n\nI have refined my formula for smart wealth creation in the last five years. Is it a secret formula? No. Is it prescriptive or one-size-fits-all? No, and no. \n\nBut, the formula has merit. And I wish I had known it earlier. The Idols Framework is foundational. With it in place, I can enjoy the adventure of life.\n<n>\n<n>\n\n## Enjoyable, stress-free wealth accumulation\n\nYou can determine the value of your time by calculating your earnings per hour worked. It makes sense to hire out jobs costing less than this measure. Unless you enjoy the job for other reasons (a hobby, for instance)... \n\nSuccessful individuals like [Ed Thorpe](https://fastfollowinvestor.com/2023/02/02/consider-studying-notable.html) drive the measure higher: What is the most money you could earn for the least amount of work?\n\nMy variation on personal _earnings per hour_ adjusts the factors slightly.\n\n1) Instead of _earnings_, I'm interested in _wealth_.\n2) I redefine _time spent (per hour)_ to _stress-level_. \n\nMy measure becomes _wealth created per stress endured_. The goal is a high score.\n\nTwo scenarios produce a high score:\n\n1) \"The Bezos\" This is extreme wealth with significant stress. The high score is due to a large wealth factor.\n2) \"The Vagabond\" This is modest, even minimal wealth, with near zero stress. The high score can be attributed to a small stress factor.\n\nIf I had to pick one, I prefer \"The Vagabond\". Stress is real, and it shortens lives. In the end, all we have is time.  Also, does extreme wealth make us happier?!  \n\nBut, I'm shooting for somewhere in the middle. Likely, we all are. We would like _enough_ wealth accumulated for the least stress. (_Enough_ means financially independent.)\n\nHow then?\n<n>\n<n>\n\n## Idols Framework for wealth creation\n\nWe will create wealth using the Idols Framework. It is a loose business and investment portfolio that I will dissect in great detail in future posts. For now, know that the Idols Framework starts with equal parts Buffett, Walton, Bogle, and Thorpe:\n \n* 25% Warren Buffett, of Berkshire Hathaway fame [**margin of safety**]\n* 25% Sam Walton, from Walmart [**micro-business**]\n* 25% John Bogle, founder of Vanguard [**buy & hold indexing**]\n* 25% [Ed Thorpe](https://fastfollowinvestor.com/2023/02/02/consider-studying-notable.html), math genius who beat Vegas and Wall Street [**quantitative trend**]\n\nThe prerequisite to employing the Idols Framework is simple. You must be great (top quartile) at two or more skills that you combine to provide unique value to a niche market.\n\nThe perfect example is Scott Adams, cartoonist. He combined his skills of 1) drawing 2) comedy and 3) corporate experience to produce the successful \"Dilbert\" cartoon series. [Here](https://dilbertblog.typepad.com/the_dilbert_blog/2007/07/career-advice.html) is his take.\n\nEarly in life, you will build your skills and also your **margin of safety**. Also called an emergency fund, this is the Buffett slice of the Idols Framework. It provides work flexibility. \n\nLater, use this money to be opportunistic. With it, you can take advantage of major market declines (black swan events). Buy when everyone else is selling.\n\nNext, create a **micro-business**. Walton is the second slice, but not because Walmart is so giant. I choose [Walton](https://pod.link/founders/episode/0d9ae711909cea651afe820cb7a9eb00) to emulate because he's claimed he didn't create anything original. Sam Walton learned his best ideas from others. Then, he combined and aligned the ideas with his vision.  \n\nI love this fact because it means _anyone_ can start a business. Keep it very small (micro) to maintain sole control. Then, you alone can steer the business to low-stress waters.\n\nReal estate investment makes me anxious. I fear waking from a deep slumber to replace toilets in the middle of the night. But many disagree with me. Small-scale real estate investment also qualifies as a micro-business. In fact, I'm advising my son to buy two four-plexes early in life.\n\nAt last, the Bogle and Thorpe slices work together to compound your savings. I invest in two Vanguard index funds: 60% in VTI (US) and 40% in VXUS (non-US). These percentages align with the market capitalization of the world stock market.\n\nThe Idols Framework's last slice is my [Fast Follow Investor](https://fastfollowinvestor.com/invest-like-me/) strategy. It replicates **quantitative trend** models built on Ed Thorpe’s early work. The strategy provides deep diversification alongside market-based, passive, **buy & hold indexing** (VTI/ VXUS). \n\nThese investment models need no investment expertise. But you must stay diligent. This is easier said than done. In fact, it's the human side of investing that is the most difficult. \n\nOne can practice a level-headed temperament with good planning, habit-building, and support. I write a lot about [this](https://fastfollowinvestor.com/2023/01/30/the-great-one.html).\n\nI list the four slices of the Idols framework at 25% each, but percentages do vary for me. And they will for you. In fact, they _should_ flex as you move through life. They will vary based on life stage, the economy, and when opportunities or risks present themselves.\n<n>\n<n>\n\n## Putting it all together\n\nNow, let's revisit our _wealth created per stress endured_ measure. We achieve a high score by accumulating _enough_ wealth with very little stress:\n\n* The Bogle and Thorpe investment models are proven and mindless to use.\n* With Walton, you stay small (micro!) and navigate your work life as you see fit.\n* And Buffett's margin of safety provides additional padding... so you can \"be greedy when others are fearful\".\n\nGreat wealth with little stress. Magic.\n\n> Follow the Idols Framework to run a self-directed, micro-business with cash on hand to take advantage of undervalued assets all the while producing high investment returns that are fully diversified.\n\nThat sentence is long. But, I'll keep this post short. I have so much more to share. Please stay tuned.\n<n>\n<n>\n<n>\n\n[Subscribe](https://fastfollowinvestor.com/subscribe/) to get my posts sent to your Inbox. \n",
				"date_published": "2023-02-15T10:51:35-08:00",
				"url": "https://fastfollowinvestor.com/2023/02/13/this-is-my.html",
				"tags": ["money and markets"]
			},
			{
				"id": "http://brianh.micro.blog/2023/02/03/is-the-fast.html",
				"title": "Is the Fast Follow Investor blog written for me? Let me answer that...",
				"content_html": "<p><em>Every blog or website should feature an &ldquo;About You&rdquo; page.</em>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>When writing for an audience, experts instruct us to niche down. &ldquo;Write for a very small audience, one that you understand deeply.&rdquo; A narrow and deep niche helps us provide worthy advice.</p>\n<p><em>Don&rsquo;t try to be everything to everyone.</em> It&rsquo;s the rule behind the wonderful <a href=\"https://kk.org/thetechnium/1000-true-fans/\">1000 true fans</a> model for creators. The recipe:</p>\n<ol>\n<li>Discover yourself and your passion.</li>\n<li>Share that passion.</li>\n<li>Then, rely on the power of the internet: your tribe will find you.</li>\n</ol>\n<p>Niche. Tribe. There are many names: target market, micro-niche, intended reader, marketing persona, target audience, and avatar. I&rsquo;m sure there are more.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"my-intended-reader\">My Intended Reader</h2>\n<p>Simply put, I write <a href=\"https://fastfollowinvestor.com/\">fastfollowinvestor.com</a> for me. I write for me as someone who is 5 years from finding financial freedom. But, I also write for my younger self&hellip;on lessons I wish I had known earlier. I also write for my future self&hellip;helping me visualize what I want my life to become.</p>\n<p>You may not be a 47-year-old, married, father of one who is a management consultant by day and lover of great biographies by night. (P.S. I recommend Ben Franklin, Charlie Munger, and <a href=\"https://fastfollowinvestor.com/2023/02/02/consider-studying-notable.html\">Ed Thorpe</a>). Still, I hope you find my ramblings helpful as you pursue <em>your</em> well-intentioned life.</p>\n<p>Now you know who I&rsquo;m writing for. But, <em>why</em> do I do it? Why do I share personal experiences about wealth building, investing, and living a meaningful life? There are three reasons.</p>\n<ol>\n<li>Writing what I learned (or am learning) clarifies my thinking and reinforces lessons.</li>\n<li>I hope my son learns from my experiences early and gets a jump on living his best life.</li>\n<li>After I die, I wish for future generations to know me and my beliefs. I wish not to be long forgotten.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></li>\n</ol>\n<h2 id=\"defining-traits\">Defining Traits</h2>\n<p>Here is a list of my typical reader&rsquo;s traits and experiences. If you identify with a majority, this blog is for you.</p>\n<p><em>Who you are:</em></p>\n<ul>\n<li>You know more about money and investing than the average person.</li>\n<li>You know debt is bad, and so you don&rsquo;t have any. That is, except for your home or other real estate.</li>\n<li>And, you use credit cards but only for cash back and points.</li>\n<li>You have the right insurance on your life, your earnings (long-term disability), and your property. You have added liability coverage (umbrella).</li>\n<li>You know high fees are bad and watch for that in your mutual and exchange-traded funds.</li>\n<li>You know indexing is good.</li>\n<li>You know commissioned investments are bad.</li>\n<li>An insurance salesman has burned you early in life. Whole-life, anyone?</li>\n<li>You work with a financial advisor, but on a fee-only or assets-under-management arrangement.</li>\n<li>You’re <em>not</em> a professional investor nor do you want to be. You don&rsquo;t follow macro-trends, interest rate moves, or credit spreads.</li>\n<li>You know the market moves irrationally, and that you cannot predict it in the short-term.</li>\n<li>You know that the stock market eventually goes up. At least, it has for the past 40 years!</li>\n<li>You don&rsquo;t pay for investment newsletters.</li>\n<li>Vanguard is your friend. You respect John Bogle.</li>\n<li>You find Warren Buffett interesting but don&rsquo;t know who <a href=\"https://fastfollowinvestor.com/2023/02/02/consider-studying-notable.html\">Edward Thorpe</a> is.</li>\n<li>You work hard and may find yourself in a corporate job&hellip;</li>\n<li>But you dream of working for yourself&hellip;</li>\n<li>And of retiring early, the ultimate form of independence. You&rsquo;ve dabbled in the F.I.R.E movement.</li>\n<li>You watch your living expenses but splurge every so often.</li>\n<li>You max out your 401k. You invested in a Roth IRA until your salary got too high, and now you wonder if it makes sense to fund a traditional IRA.</li>\n<li>You work hard with your head down. Retirement seems pretty far away (though it doesn&rsquo;t have to be).</li>\n<li>When you did take a moment to think about retirement, you discovered Required Minimum Distributions. :-(</li>\n<li>You were taught &ldquo;if it&rsquo;s too good to be true, it likely is&rdquo; and so are wary of get-rich-quick schemes. But it still would be nice to win the lottery&hellip;\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></li>\n</ul>\n<p><em>Who you want to be:</em></p>\n<ul>\n<li>You want to work in a job you enjoy.</li>\n<li>You want less stress.</li>\n<li>You want to travel more.</li>\n<li>You don&rsquo;t necessarily seek high pay, but most definitely <em>do</em> seek more wealth.</li>\n<li>You desire financial freedom sooner than most, so you can enjoy life&hellip;perhaps doing something different.</li>\n<li>To get there faster, you seek out new ways to improve on the great foundation that you&rsquo;ve already built: retirement plan(s), low-cost mutual funds, emergency cash reserve, and possibly even a rental property.</li>\n<li>You want to provide the best possible life for yourself and your family.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></li>\n</ul>\n<h2 id=\"is-this-you\">Is This You?</h2>\n<p>Do you find yourself in any of these situations?</p>\n<ol>\n<li>You are unhappy in your current job. Or, you find yourself using financial calculators to estimate how much you need to retire. Whatever the case, you want to <a href=\"https://fastfollowinvestor.com/\">speed up financial independence</a> (a.k.a. retire early).</li>\n<li>You&rsquo;ve taken the plunge. You&rsquo;re retired. It&rsquo;s more nerve-racking than you anticipated. Without your full-time job, you no longer add to your savings each month. The thought of a stock market <a href=\"https://fastfollowinvestor.com/2022/11/08/you-not-the.html\">drop of 35% freaks you out</a>.</li>\n<li>You have recently come into an inheritance. Congratulations! But, you&rsquo;re worried about investing it into a frothy, even bubbly stock market. Should you dollar cost average? <a href=\"https://fastfollowinvestor.com/2022/12/23/buy-hold-investing.html\">What if the 2020s turn into a lost decade</a>?</li>\n<li>Your problem is not financial, but psychological. You no longer have the fortitude to stick with an investing approach. Perhaps, like me, you experienced an investment loss of your own doing (or had a near miss). Your <a href=\"https://fastfollowinvestor.com/2023/01/30/the-great-one.html\">emotions took hold</a> in a way you didn&rsquo;t expect.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></li>\n</ol>\n<p>Tell me, did any of these resonate with you?</p>\n<p><strong>If yes, you, my friend, are my intended reader.</strong></p>\n<p>Welcome one and all!\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p><a href=\"https://fastfollowinvestor.com/subscribe/\">Subscribe</a> to get my posts sent to your Inbox.</p>\n",
				"content_text": "_Every blog or website should feature an \"About You\" page._\n<n>\n<n>\n\nWhen writing for an audience, experts instruct us to niche down. \"Write for a very small audience, one that you understand deeply.\" A narrow and deep niche helps us provide worthy advice.\n\n_Don't try to be everything to everyone._ It's the rule behind the wonderful [1000 true fans](https://kk.org/thetechnium/1000-true-fans/) model for creators. The recipe:\n\n1) Discover yourself and your passion.\n2) Share that passion.\n3) Then, rely on the power of the internet: your tribe will find you.\n\n\nNiche. Tribe. There are many names: target market, micro-niche, intended reader, marketing persona, target audience, and avatar. I'm sure there are more.\n<n>\n<n>\n\n## My Intended Reader\n\nSimply put, I write [fastfollowinvestor.com](https://fastfollowinvestor.com/) for me. I write for me as someone who is 5 years from finding financial freedom. But, I also write for my younger self...on lessons I wish I had known earlier. I also write for my future self...helping me visualize what I want my life to become.\n\nYou may not be a 47-year-old, married, father of one who is a management consultant by day and lover of great biographies by night. (P.S. I recommend Ben Franklin, Charlie Munger, and [Ed Thorpe](https://fastfollowinvestor.com/2023/02/02/consider-studying-notable.html)). Still, I hope you find my ramblings helpful as you pursue _your_ well-intentioned life.\n\nNow you know who I'm writing for. But, _why_ do I do it? Why do I share personal experiences about wealth building, investing, and living a meaningful life? There are three reasons.\n\n1) Writing what I learned (or am learning) clarifies my thinking and reinforces lessons.\n2) I hope my son learns from my experiences early and gets a jump on living his best life.\n3) After I die, I wish for future generations to know me and my beliefs. I wish not to be long forgotten.\n<n>\n<n>\n\n## Defining Traits\n\nHere is a list of my typical reader's traits and experiences. If you identify with a majority, this blog is for you.\n\n_Who you are:_\n\n* You know more about money and investing than the average person.\n* You know debt is bad, and so you don't have any. That is, except for your home or other real estate.\n* And, you use credit cards but only for cash back and points.\n* You have the right insurance on your life, your earnings (long-term disability), and your property. You have added liability coverage (umbrella).\n* You know high fees are bad and watch for that in your mutual and exchange-traded funds.\n* You know indexing is good.\n* You know commissioned investments are bad.\n* An insurance salesman has burned you early in life. Whole-life, anyone?\n* You work with a financial advisor, but on a fee-only or assets-under-management arrangement.\n* You’re _not_ a professional investor nor do you want to be. You don't follow macro-trends, interest rate moves, or credit spreads.\n* You know the market moves irrationally, and that you cannot predict it in the short-term.\n* You know that the stock market eventually goes up. At least, it has for the past 40 years!\n* You don't pay for investment newsletters.\n* Vanguard is your friend. You respect John Bogle.\n* You find Warren Buffett interesting but don't know who [Edward Thorpe](https://fastfollowinvestor.com/2023/02/02/consider-studying-notable.html) is.\n* You work hard and may find yourself in a corporate job...\n* But you dream of working for yourself...\n* And of retiring early, the ultimate form of independence. You've dabbled in the F.I.R.E movement.\n* You watch your living expenses but splurge every so often.\n* You max out your 401k. You invested in a Roth IRA until your salary got too high, and now you wonder if it makes sense to fund a traditional IRA.\n* You work hard with your head down. Retirement seems pretty far away (though it doesn't have to be).\n* When you did take a moment to think about retirement, you discovered Required Minimum Distributions. :-(\n* You were taught \"if it's too good to be true, it likely is\" and so are wary of get-rich-quick schemes. But it still would be nice to win the lottery...\n<n>\n<n>\n\n_Who you want to be:_\n\n* You want to work in a job you enjoy.\n* You want less stress.\n* You want to travel more.\n* You don't necessarily seek high pay, but most definitely _do_ seek more wealth.\n* You desire financial freedom sooner than most, so you can enjoy life...perhaps doing something different.\n* To get there faster, you seek out new ways to improve on the great foundation that you've already built: retirement plan(s), low-cost mutual funds, emergency cash reserve, and possibly even a rental property.\n* You want to provide the best possible life for yourself and your family.\n<n>\n<n>\n\n## Is This You?\n\nDo you find yourself in any of these situations?\n\n1) You are unhappy in your current job. Or, you find yourself using financial calculators to estimate how much you need to retire. Whatever the case, you want to [speed up financial independence](https://fastfollowinvestor.com/) (a.k.a. retire early).\n2) You've taken the plunge. You're retired. It's more nerve-racking than you anticipated. Without your full-time job, you no longer add to your savings each month. The thought of a stock market [drop of 35% freaks you out]( https://fastfollowinvestor.com/2022/11/08/you-not-the.html).\n3) You have recently come into an inheritance. Congratulations! But, you're worried about investing it into a frothy, even bubbly stock market. Should you dollar cost average? [What if the 2020s turn into a lost decade]( https://fastfollowinvestor.com/2022/12/23/buy-hold-investing.html )?\n4) Your problem is not financial, but psychological. You no longer have the fortitude to stick with an investing approach. Perhaps, like me, you experienced an investment loss of your own doing (or had a near miss). Your [emotions took hold](https://fastfollowinvestor.com/2023/01/30/the-great-one.html) in a way you didn't expect.\n<n>\n<n>\n \nTell me, did any of these resonate with you?\n\n**If yes, you, my friend, are my intended reader.**\n\nWelcome one and all! \n<n>\n<n>\n\n[Subscribe](https://fastfollowinvestor.com/subscribe/) to get my posts sent to your Inbox.\n",
				"date_published": "2023-02-10T20:33:20-08:00",
				"url": "https://fastfollowinvestor.com/2023/02/03/is-the-fast.html",
				"tags": ["money and markets"]
			},
			{
				"id": "http://brianh.micro.blog/2023/02/02/consider-studying-notable.html",
				"title": "Study notable life stories and find yourself a role model. It's an entertaining way to learn from the best.",
				"content_html": "<p><em>Ed Thorpe is a mathematical genius, but his approach to life is what most impresses me.</em>\n<!-- raw HTML omitted --></p>\n<p>Ed Thorpe is a beacon to me. I finished his autobiography last week. He offers a great personal blueprint for living your life. If these highlights inspire you, I urge you to read the entire book. Ed has so much to offer.</p>\n<p>I had not known of Ed Thorpe until 2021. He is the first modern mathematician to investigate <em>risk</em> and achieve great financial success doing so. He devised ways to beat the casinos in blackjack and roulette. Later, he used similar techniques to win at investing with his hedge fund, Princeton Newport Partners.</p>\n<p>His mathematical perspectives on investments underpin the <a href=\"https://fastfollowinvestor.com/invest-like-me/\">fastfollowinvestor.com</a> investing strategy. And the book details it in a way we can all understand.</p>\n<p>But, Ed&rsquo;s approach to life serves up even more lessons.</p>\n<p>In <a href=\"https://www.amazon.com/Man-All-Markets-Street-Dealer-ebook/dp/B00SEFEYCI/ref=tmm_kin_swatch_0?_encoding=UTF8&amp;qid=1674765641&amp;sr=8-1\">A Man for All Markets: From Las Vegas to Wall Street, How I Beat the Dealer and the Market</a>, Ed takes us on his journey from depression-era Chicago to MIT to mafia-controlled Las Vegas and finally Wall Street. Then, suddenly, he casts all of his professional success aside.</p>\n<p>At its core, this is a book about how to live your best life.</p>\n<p>&ldquo;What matters in life is how you spend your time. Life is like reading a novel or running a marathon. It’s not so much about reaching a goal but rather about the journey itself and the experiences along the way.&rdquo;</p>\n<p>Ed learned from Benjamin Franklin (another favorite of mine) who became financially independent at 42 years old. It was Franklin who said:</p>\n<p>“Time is the stuff life is made of, and how you spend it makes all the difference.&quot;</p>\n<p>Franklin followed his own interests in his next 42 years, and his accomplishments are remarkable.</p>\n<p>Ed Thorpe advises that we:</p>\n<ul>\n<li>Stay independent and in control of our lives</li>\n<li>Keep humble</li>\n<li>Be great, not grand (Don&rsquo;t get big for big&rsquo;s sake.)</li>\n<li>Strive for simplicity</li>\n<li>Develop systems for everything in life</li>\n</ul>\n<p>On investing, Ed believes in finding a simple edge and betting on yourself. At the same time, you must control the size of your bets to cap any losses.</p>\n<ul>\n<li>&ldquo;I also believed then, as I do now after more than fifty years as a money manager, that the surest way to get rich is to play only those gambling games or make those investments where I have an edge.&rdquo;</li>\n<li>&ldquo;A good defense keeps other people from taking your money. As Warren Buffet said: &lsquo;In order to succeed you must first survive. You need to avoid ruin. At all costs.&rsquo;.&rdquo;</li>\n</ul>\n<p>In the book, Ed clarifies these points with a sports analogy. The very best teams have both a very good offense and a very good defense. Neither has to be the best, but both must be strong to win championships.</p>\n<p>I&rsquo;d like to close by giving Ed the last words:</p>\n<p>&ldquo;When Princeton Newport Partners closed, Vivian (Ed&rsquo;s wife) and I had money enough for the rest of our lives&hellip;. it freed us to do more of what we enjoyed most: spend time with each other and the family and friends we loved, travel, and pursue our interests.</p>\n<p>Taking to heart the lyrics of the song “Enjoy Yourself (It’s Later than You Think),” Vivian and I would make the most of the one thing we could never have enough of—time together. Success on Wall Street was getting the most money. Success for us was having the best life.</p>\n<p>Whatever you do, enjoy your life and the people who share it with you, and leave something good of yourself for the generations to follow. &quot;\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p><a href=\"https://fastfollowinvestor.com/subscribe/\">Subscribe</a> to get my posts sent to your Inbox.</p>\n<hr>\n<p>References:</p>\n<p><a href=\"https://founders.simplecast.com/episodes/a-man-for-all-markets-from-las-vegas-to-wall-street-how-i-beat-the-dealer-and-the-market\">Founder&rsquo;s podcast Ed Thorpe episode</a></p>\n<p><a href=\"https://25iq.com/2017/07/22/a-dozen-lessons-on-investing-from-ed-thorp/\">A dozen lessons from Ed Thorpe blog</a></p>\n<p><a href=\"https://nntaleb.medium.com/foreword-to-ed-thorps-memoirs-a-man-for-all-markets-6beba78cd2b\">Nassim Taleb&rsquo;s book forward on Medium</a></p>\n",
				"content_text": "_Ed Thorpe is a mathematical genius, but his approach to life is what most impresses me._\n<n>\n\nEd Thorpe is a beacon to me. I finished his autobiography last week. He offers a great personal blueprint for living your life. If these highlights inspire you, I urge you to read the entire book. Ed has so much to offer.\n\nI had not known of Ed Thorpe until 2021. He is the first modern mathematician to investigate _risk_ and achieve great financial success doing so. He devised ways to beat the casinos in blackjack and roulette. Later, he used similar techniques to win at investing with his hedge fund, Princeton Newport Partners. \n\nHis mathematical perspectives on investments underpin the [fastfollowinvestor.com](https://fastfollowinvestor.com/invest-like-me/) investing strategy. And the book details it in a way we can all understand.\n\nBut, Ed's approach to life serves up even more lessons.\n\nIn [A Man for All Markets: From Las Vegas to Wall Street, How I Beat the Dealer and the Market](https://www.amazon.com/Man-All-Markets-Street-Dealer-ebook/dp/B00SEFEYCI/ref=tmm_kin_swatch_0?_encoding=UTF8&qid=1674765641&sr=8-1), Ed takes us on his journey from depression-era Chicago to MIT to mafia-controlled Las Vegas and finally Wall Street. Then, suddenly, he casts all of his professional success aside. \n\nAt its core, this is a book about how to live your best life.\n\n\"What matters in life is how you spend your time. Life is like reading a novel or running a marathon. It’s not so much about reaching a goal but rather about the journey itself and the experiences along the way.\"\n\nEd learned from Benjamin Franklin (another favorite of mine) who became financially independent at 42 years old. It was Franklin who said:\n\n“Time is the stuff life is made of, and how you spend it makes all the difference.\" \n\nFranklin followed his own interests in his next 42 years, and his accomplishments are remarkable. \n\nEd Thorpe advises that we:\n* Stay independent and in control of our lives\n* Keep humble\n* Be great, not grand (Don't get big for big's sake.) \n* Strive for simplicity\n* Develop systems for everything in life\n\nOn investing, Ed believes in finding a simple edge and betting on yourself. At the same time, you must control the size of your bets to cap any losses.\n \n* \"I also believed then, as I do now after more than fifty years as a money manager, that the surest way to get rich is to play only those gambling games or make those investments where I have an edge.\"\n* \"A good defense keeps other people from taking your money. As Warren Buffet said: 'In order to succeed you must first survive. You need to avoid ruin. At all costs.'.\"\n\nIn the book, Ed clarifies these points with a sports analogy. The very best teams have both a very good offense and a very good defense. Neither has to be the best, but both must be strong to win championships.\n\nI'd like to close by giving Ed the last words:\n\n\"When Princeton Newport Partners closed, Vivian (Ed's wife) and I had money enough for the rest of our lives.... it freed us to do more of what we enjoyed most: spend time with each other and the family and friends we loved, travel, and pursue our interests. \n\nTaking to heart the lyrics of the song “Enjoy Yourself (It’s Later than You Think),” Vivian and I would make the most of the one thing we could never have enough of—time together. Success on Wall Street was getting the most money. Success for us was having the best life. \n\nWhatever you do, enjoy your life and the people who share it with you, and leave something good of yourself for the generations to follow. \"\n<n>\n<n>\n\n[Subscribe](https://fastfollowinvestor.com/subscribe/) to get my posts sent to your Inbox.\n\n---\nReferences:\n\n[Founder's podcast Ed Thorpe episode](https://founders.simplecast.com/episodes/a-man-for-all-markets-from-las-vegas-to-wall-street-how-i-beat-the-dealer-and-the-market)\n\n[A dozen lessons from Ed Thorpe blog](https://25iq.com/2017/07/22/a-dozen-lessons-on-investing-from-ed-thorp/)\n\n[Nassim Taleb's book forward on Medium](https://nntaleb.medium.com/foreword-to-ed-thorps-memoirs-a-man-for-all-markets-6beba78cd2b)\n",
				"date_published": "2023-02-09T08:57:29-08:00",
				"url": "https://fastfollowinvestor.com/2023/02/02/consider-studying-notable.html",
				"tags": ["money and markets"]
			},
			{
				"id": "http://brianh.micro.blog/2023/02/01/hey-there-my.html",
				"title": "Hey there, my February 2023 trades are made! ",
				"content_html": "<h2 id=\"here-is-my-monthly-process\">Here is my monthly process</h2>\n<p><em>Trigger:</em> At 4PM Eastern, the market closes on the last trading day of the month.</p>\n<ol>\n<li>Immediately, my FastFollowInvestor.com (FFI) model* identifies those investments to add to or reduce.</li>\n<li>At 5PM Eastern, I email my investment changes** to friends and colleagues.</li>\n<li>That night, I have a (working) dinner date with my wife. We use a spreadsheet to calculate buy/sell trades in our investment accounts to match the model.***</li>\n<li>At 10AM Eastern on the first trading day of the next month, I log into our accounts to buy/sell ETFs as we calculated the night before.</li>\n</ol>\n<p>This process is repeated every month&hellip;forever!</p>\n<p>The highlight is definitely dinner with my wife.</p>\n<p>But, I should not skip over this fact too quickly. The most difficult part of investing is psychology. How do you stick with it through good times and bad? By tying monthly FFI trades to a dinner date, I&rsquo;m creating a habit that I can commit to for decades.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"what-changes-did-i-make-in-february\">What changes did I make in February?</h2>\n<p>Gold and international equities were winning trades in December and January. The FastFollowInvestor.com model increased both positions in February.</p>\n<ul>\n<li>Gold is now nearly 40% of my portfolio (up 25%)</li>\n<li>International equities stand at 45% (up 10%)</li>\n</ul>\n<p>February also brings a new allocation to mortgage REITs (up 10% to 10%).</p>\n<p>And, after languishing for 3 months, I hold no more commodities (down 10% to 0%).</p>\n<p>What remains is very little cash (less than 5%). It is interesting that just 3 months ago, FFI held an 80% cash position!</p>\n<p>One thing I love about this system: I must never decide when to move out of cash and into the market. The model does it for me.</p>\n<p>See you next month! :-)\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p><a href=\"https://fastfollowinvestor.com/subscribe/\">Subscribe</a> to get my posts sent to your Inbox.</p>\n<hr>\n<p>*FFI is a deeply diversified portfolio of <em>asset allocation, trend-following models</em> for individual investors.</p>\n<p>**Broad-based, liquid ETF indices of stocks, bonds, real estate, gold, and commodities are possible FFI investments.</p>\n<p>***I think of these trades as monthly rebalancing into the best-trending investments.</p>\n",
				"content_text": "## Here is my monthly process\n\n_Trigger:_ At 4PM Eastern, the market closes on the last trading day of the month.\n\n1) Immediately, my FastFollowInvestor.com (FFI) model* identifies those investments to add to or reduce.\n2) At 5PM Eastern, I email my investment changes** to friends and colleagues.\n3) That night, I have a (working) dinner date with my wife. We use a spreadsheet to calculate buy/sell trades in our investment accounts to match the model.***\n4) At 10AM Eastern on the first trading day of the next month, I log into our accounts to buy/sell ETFs as we calculated the night before.\n\nThis process is repeated every month...forever! \n\nThe highlight is definitely dinner with my wife. \n\nBut, I should not skip over this fact too quickly. The most difficult part of investing is psychology. How do you stick with it through good times and bad? By tying monthly FFI trades to a dinner date, I'm creating a habit that I can commit to for decades.\n<n>\n<n>\n\n\n## What changes did I make in February?\n\nGold and international equities were winning trades in December and January. The FastFollowInvestor.com model increased both positions in February.  \n\n* Gold is now nearly 40% of my portfolio (up 25%)\n* International equities stand at 45% (up 10%)\n           \nFebruary also brings a new allocation to mortgage REITs (up 10% to 10%).\n\nAnd, after languishing for 3 months, I hold no more commodities (down 10% to 0%).\n\nWhat remains is very little cash (less than 5%). It is interesting that just 3 months ago, FFI held an 80% cash position!\n\nOne thing I love about this system: I must never decide when to move out of cash and into the market. The model does it for me. \n\nSee you next month! :-)\n<n>\n<n>\n\n[Subscribe](https://fastfollowinvestor.com/subscribe/) to get my posts sent to your Inbox.\n\n\n---\n *FFI is a deeply diversified portfolio of _asset allocation, trend-following models_ for individual investors. \n\n**Broad-based, liquid ETF indices of stocks, bonds, real estate, gold, and commodities are possible FFI investments.\n\n***I think of these trades as monthly rebalancing into the best-trending investments.\n",
				"date_published": "2023-02-02T10:13:07-08:00",
				"url": "https://fastfollowinvestor.com/2023/02/01/hey-there-my.html",
				"tags": ["money and markets"]
			},
			{
				"id": "http://brianh.micro.blog/2023/01/30/the-great-one.html",
				"title": "The great one tells us to \"be greedy when others are fearful\". But, how exactly?",
				"content_html": "<p><em>Economists say humans are rational and emotionless investors. Wrong! Humans are highly emotional, and it hurts our portfolios. The good news is that we can train ourselves to become more levelheaded investors. Take these 3 specific actions&hellip;</em>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>On December 9, I shared my <a href=\"https://fastfollowinvestor.com/2022/12/01/my-dec-portfolio.html\">December 2022 trades</a>. International markets trended up in November. So, at the direction of the Fast Follow Investor (FFI) model, I moved ~50% of my portfolio from cash to international equities. At the time, I was nervous, noting:</p>\n<blockquote>\n<p>My head and my heart tell me this is a precarious time to &ldquo;get back in&rdquo;. But the market and the model disagree.\n<!-- raw HTML omitted -->\n“When it comes time to buy and it’s the right time, you will not want to. When it comes time to sell and it’s the right time, you will not want to.”\n<!-- raw HTML omitted -->\nRemember: Just like Buy &amp; Hold, Fast Follow trend investing requires fortitude to stick with it.\n<!-- raw HTML omitted --></p>\n</blockquote>\n<p>Warren Buffett has said: “Success in investing doesn’t correlate with IQ … what you need is the temperament to control the urges that get other people into trouble.”</p>\n<p>I agree. Successful investors remain calm when everyone around them is pulling their hair out. A levelheaded temperament helps them stick to the plan. That sounds great. But how, exactly?</p>\n<p>There are three things you can do to develop and exploit a calm, levelheaded temperament:</p>\n<ol>\n<li>Develop your &ldquo;edge&rdquo; by picking the right investment system and knowing it better than anyone else.</li>\n</ol>\n<ul>\n<li>Whether in stock selection (Buffett), hedging (Thorpe), real estate investment (any local expert), index funds (Vanguard) or otherwise, choose a system where you know more.</li>\n<li>Then, exploit that knowledge by betting on yourself.</li>\n<li>For me, this is Fast Follow Investing.\n<!-- raw HTML omitted --></li>\n</ul>\n<ol start=\"2\">\n<li>Control your amount of money invested (bet size) so the particular investment system will never wipe you out, even if a black swan event should occur.</li>\n</ol>\n<ul>\n<li>Start slow (to go fast) and ramp up your invested savings over time.</li>\n<li>Bet more when favorable to do so, and less when unfavorable per the Kelly criterion.</li>\n<li>Always keep some of your wealth in cash or U.S. treasury bills. This establishes a margin of safety, as Buffett recommends.\n<!-- raw HTML omitted --></li>\n</ul>\n<p>Once you 1) find your investing edge and improve on it over time, and all the while 2) protect yourself from major losses, you&rsquo;re halfway there.</p>\n<p>The hardest part is to put systems in place to stay levelheaded and focused, despite difficult times:\n<!-- raw HTML omitted --></p>\n<ol start=\"3\">\n<li>Finally, turn your positive behaviors into habits. Then, investment decisions (according to your preferred system) become automatic.</li>\n</ol>\n<ul>\n<li>Tie preferred human behaviors to positive external triggers. E.g., review investments as part of a monthly dinner date with your spouse (no kids!).</li>\n<li>Make the impact of not sticking to your habit explicitly known. E.g., project how you&rsquo;d feel if you missed a future opportunity because it would be too difficult to take action now.</li>\n<li>Establish social support systems to cheer you on in challenging times.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></li>\n</ul>\n<p>Fortunately, I made that December 1st trade into international equities. As a result, my portfolio is up 5% in two months. Of course, international equities could have gone down, and the FFI model would have adjusted accordingly. Up or down, I am happy I was able to stick with the system that gives me my edge.</p>\n<p>I will continue to find and meet these challenges each month&hellip;with some months proving more difficult than others.</p>\n<p>By reading these posts, you help hold me accountable! Thank you for cheering me on.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p><a href=\"https://fastfollowinvestor.com/subscribe/\">Subscribe</a> to get my posts sent to your Inbox.</p>\n",
				"content_text": "_Economists say humans are rational and emotionless investors. Wrong! Humans are highly emotional, and it hurts our portfolios. The good news is that we can train ourselves to become more levelheaded investors. Take these 3 specific actions..._\n<br>\n<br> \n\nOn December 9, I shared my [December 2022 trades](https://fastfollowinvestor.com/2022/12/01/my-dec-portfolio.html). International markets trended up in November. So, at the direction of the Fast Follow Investor (FFI) model, I moved ~50% of my portfolio from cash to international equities. At the time, I was nervous, noting:\n\n> My head and my heart tell me this is a precarious time to \"get back in\". But the market and the model disagree.\n<br>\n> “When it comes time to buy and it’s the right time, you will not want to. When it comes time to sell and it’s the right time, you will not want to.”\n<br>\n> Remember: Just like Buy & Hold, Fast Follow trend investing requires fortitude to stick with it. \n<br>\n\nWarren Buffett has said: “Success in investing doesn’t correlate with IQ … what you need is the temperament to control the urges that get other people into trouble.” \n\nI agree. Successful investors remain calm when everyone around them is pulling their hair out. A levelheaded temperament helps them stick to the plan. That sounds great. But how, exactly? \n\nThere are three things you can do to develop and exploit a calm, levelheaded temperament:\n\n1) Develop your \"edge\" by picking the right investment system and knowing it better than anyone else.\n\n* Whether in stock selection (Buffett), hedging (Thorpe), real estate investment (any local expert), index funds (Vanguard) or otherwise, choose a system where you know more.\n* Then, exploit that knowledge by betting on yourself.\n* For me, this is Fast Follow Investing.\n<br> \n\n2) Control your amount of money invested (bet size) so the particular investment system will never wipe you out, even if a black swan event should occur.\n\n* Start slow (to go fast) and ramp up your invested savings over time.\n* Bet more when favorable to do so, and less when unfavorable per the Kelly criterion.\n* Always keep some of your wealth in cash or U.S. treasury bills. This establishes a margin of safety, as Buffett recommends.\n<br>\n\nOnce you 1) find your investing edge and improve on it over time, and all the while 2) protect yourself from major losses, you're halfway there. \n\nThe hardest part is to put systems in place to stay levelheaded and focused, despite difficult times:\n<br>\n\n3) Finally, turn your positive behaviors into habits. Then, investment decisions (according to your preferred system) become automatic.\n\n* Tie preferred human behaviors to positive external triggers. E.g., review investments as part of a monthly dinner date with your spouse (no kids!).\n* Make the impact of not sticking to your habit explicitly known. E.g., project how you'd feel if you missed a future opportunity because it would be too difficult to take action now.\n* Establish social support systems to cheer you on in challenging times.\n<br>\n<br> \n\nFortunately, I made that December 1st trade into international equities. As a result, my portfolio is up 5% in two months. Of course, international equities could have gone down, and the FFI model would have adjusted accordingly. Up or down, I am happy I was able to stick with the system that gives me my edge.\n\nI will continue to find and meet these challenges each month...with some months proving more difficult than others. \n\nBy reading these posts, you help hold me accountable! Thank you for cheering me on.\n<n>\n<n>\n\n[Subscribe](https://fastfollowinvestor.com/subscribe/) to get my posts sent to your Inbox.\n",
				"date_published": "2023-01-30T11:51:40-08:00",
				"url": "https://fastfollowinvestor.com/2023/01/30/the-great-one.html",
				"tags": ["money and markets"]
			},
			{
				"id": "http://brianh.micro.blog/2022/12/23/buy-hold-investing.html",
				"title": "Buy \u0026 Hold investing can leave you feeling powerless. Add some TAA to your portfolio and take back control.",
				"content_html": "<p><em>Tactical Asset Allocation (TAA) adds strong diversification alongside a Buy &amp; Hold investment strategy. I compare the two strategies and highlight their differences.</em></p>\n<!-- raw HTML omitted -->\n<p>In my 20s, I consulted for Accenture out of its Milwaukee office. One highlight of working at a big firm in the late 90s was the sometimes extravagant employee perks.</p>\n<p>The greatest perk took place one day in October every year. To reward us for a job well-done, Accenture leadership would rent out Six Flags Great America&hellip; in its entirety. I would always bring my girlfriend (now wife).</p>\n<p>Imagine showing up at Six Flags just north of Chicago, parking in the front row, and walking into an empty park. It wasn&rsquo;t as empty as Wally World when the Griswolds visited. But close&hellip;</p>\n<p>Our small group would ride Iron Wolf and American Eagle and our favorite, Raging Bull. At times you needn&rsquo;t get off to get back on! One year, I think I went on 50 rides in a day.</p>\n<p>My wife and I bonded over our shared love for roller coasters and these incredible days at Great America.</p>\n<p>In 2018, twenty years later, she and I were living in the Bay Area. That year, we hired a sitter and drove 30 minutes to Six Flags Discovery Kingdom in Vallejo. We got there early. With excitement, we boarded our first ride.</p>\n<p>When we got off, we looked at each other and said, almost in unison, &ldquo;I don&rsquo;t think I can do another one.&rdquo; We pushed through it, tried one more, and both nearly lost our breakfast. Dizzying.</p>\n<p>The roller coasting chapter of our lives had closed.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"my-investing-roller-coaster\">My investing roller coaster</h2>\n<p>I felt the same way when watching my 80/20 investment portfolio crash in March 2020. What hadn&rsquo;t bothered me in 2001 and 2008 now did. I could no longer stomach the steep losses.  Why?</p>\n<p>I looked at my now greater savings as the collection of 20+ years of hard work. Watching $300K vanish was hard to take. I remember thinking, &ldquo;I&rsquo;ve just lost 6 years of savings&hellip;6 years of sacrifice.&rdquo;</p>\n<p>At least I didn&rsquo;t pass out like I almost did at Six Flags.</p>\n<p>Now, let me fast forward through 18 months when I read everything about investing that I could get my hands on.</p>\n<p>I had found an investing strategy to complement my Buy &amp; Hold portfolio.</p>\n<p>It&rsquo;s a great diversifier, without dilution. Meaning, it enhances my investment returns.  And, best of all, it reduces my risk of severe loss and helps me sleep better at night.</p>\n<p>Tactical Asset Allocation (TAA). It&rsquo;s the investing strategy I teach at <a href=\"https://fastfollowinvestor.com/\">FastFollowInvestor.com</a>.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"comparing-two-strategies\">Comparing two strategies</h2>\n<p>To learn TAA, I checked much of what I already knew about investing at the door. Like Adam Grant recommends in <a href=\"https://www.amazon.com/dp/B08H177WQP/?coliid=I2PL85ONHI4XTC&amp;colid=1S0KE6JUF28QU&amp;psc=0&amp;ref_=lv_ov_lig_dp_it_im\">Think Again</a>, I had to 1) unlearn and 2) relearn.</p>\n<p>Take a look at these comparisons I&rsquo;ve drawn:</p>\n<!-- raw HTML omitted -->\n<p>There is a lot here, I know. It took me almost a year to understand TAA. It&rsquo;s new and different. And it doesn&rsquo;t always align with popular beliefs.</p>\n<p>So, this is my challenge: <strong>How can I best share this strategy so everyone benefits?</strong>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"expanding-the-analogy\">Expanding the analogy</h2>\n<p>Derek Thompson, one of my <a href=\"https://podcasts.apple.com/us/podcast/plain-english-with-derek-thompson/id1594471023\">favorite podcasters</a>, speaks in analogies.</p>\n<p>It can help new ideas stick. So let me try one.</p>\n<p>I think of Buy &amp; Hold investing like that ride on a roller coaster.</p>\n<!-- raw HTML omitted -->\n<p>A roller coaster entertains riders with steep climbs and steeper drops.</p>\n<p>You must put your trust in the ride because you have no control.</p>\n<p>For long stretches, there is a lot of up and down, but you make no vertical progress.</p>\n<p>But, riding is easy. You get on the ride and go (think: set it and forget it).\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>Tactical Asset Allocation (TAA) is more like a mountain trek.</p>\n<!-- raw HTML omitted -->\n<p>Hiking a mountain takes preparation and, sometimes, training.</p>\n<p>You choose your path, and so control your destiny.</p>\n<p>While you may need to backtrack, it&rsquo;s minimal if you plan your route well.</p>\n<p>When you reach the summit, you&rsquo;re exhausted but feel great given the achievement.<br>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"use-both-for-strong-diversification\">Use both for strong diversification</h2>\n<p><strong>Buy &amp; Hold and TAA are valid investing strategies.</strong></p>\n<p>You can expect positive returns from both. But, one may work better than the other in certain situations.</p>\n<p>One obvious use case: the new saver has time to reap rewards from Buy &amp; Hold.  The soon-to-be retiree does not have the time and should tilt her/his portfolio toward TAA.</p>\n<p><strong>Buy &amp; Hold and TAA are excellent diversifying strategies.</strong></p>\n<p>Together, they reduce your portfolio&rsquo;s overall volatility and don&rsquo;t dilute investment returns. Diversification, not diworsification.</p>\n<p>And how fortunate this is! Take a small piece of your Buy &amp; Hold portfolio and try it out. Dipping your toe in the TAA waters is a good way to learn something new and manage risk at the same time.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>When you&rsquo;re ready for more, you can watch my trades monthly in real-time at <a href=\"https://fastfollowinvestor.com/invest-like-me/\">FastFollowInvestor.com</a>.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<a href=\"https://fastfollowinvestor.com/subscribe/\">Subscribe</a> to get my posts sent to your Inbox.</p>\n",
				"content_text": "_Tactical Asset Allocation (TAA) adds strong diversification alongside a Buy & Hold investment strategy. I compare the two strategies and highlight their differences._\n\n<img src=\"https://fastfollowinvestor.com/uploads/2022/68465f41bf.png\" width=\"512\" height=\"512\" alt=\"\" />\n<br>\n\nIn my 20s, I consulted for Accenture out of its Milwaukee office. One highlight of working at a big firm in the late 90s was the sometimes extravagant employee perks. \n\nThe greatest perk took place one day in October every year. To reward us for a job well-done, Accenture leadership would rent out Six Flags Great America... in its entirety. I would always bring my girlfriend (now wife).\n\nImagine showing up at Six Flags just north of Chicago, parking in the front row, and walking into an empty park. It wasn't as empty as Wally World when the Griswolds visited. But close... \n\nOur small group would ride Iron Wolf and American Eagle and our favorite, Raging Bull. At times you needn't get off to get back on! One year, I think I went on 50 rides in a day. \n\nMy wife and I bonded over our shared love for roller coasters and these incredible days at Great America.\n\nIn 2018, twenty years later, she and I were living in the Bay Area. That year, we hired a sitter and drove 30 minutes to Six Flags Discovery Kingdom in Vallejo. We got there early. With excitement, we boarded our first ride.\n\nWhen we got off, we looked at each other and said, almost in unison, \"I don't think I can do another one.\" We pushed through it, tried one more, and both nearly lost our breakfast. Dizzying.\n\nThe roller coasting chapter of our lives had closed.\n<br>\n<br>\n\n## My investing roller coaster\n\nI felt the same way when watching my 80/20 investment portfolio crash in March 2020. What hadn't bothered me in 2001 and 2008 now did. I could no longer stomach the steep losses.  Why? \n\nI looked at my now greater savings as the collection of 20+ years of hard work. Watching $300K vanish was hard to take. I remember thinking, \"I've just lost 6 years of savings...6 years of sacrifice.\"\n\nAt least I didn't pass out like I almost did at Six Flags.\n\nNow, let me fast forward through 18 months when I read everything about investing that I could get my hands on. \n\nI had found an investing strategy to complement my Buy & Hold portfolio.  \n\nIt's a great diversifier, without dilution. Meaning, it enhances my investment returns.  And, best of all, it reduces my risk of severe loss and helps me sleep better at night.\n\nTactical Asset Allocation (TAA). It's the investing strategy I teach at [FastFollowInvestor.com](https://fastfollowinvestor.com/).\n<br>\n<br>\n\n## Comparing two strategies\n\nTo learn TAA, I checked much of what I already knew about investing at the door. Like Adam Grant recommends in [Think Again](https://www.amazon.com/dp/B08H177WQP/?coliid=I2PL85ONHI4XTC&colid=1S0KE6JUF28QU&psc=0&ref_=lv_ov_lig_dp_it_im), I had to 1) unlearn and 2) relearn.\n\nTake a look at these comparisons I've drawn:\n\n<img src=\"https://fastfollowinvestor.com/uploads/2022/f0156b8115.png\" width=\"600\" height=\"383\" alt=\"\" />\n<br>\n<br>\n\nThere is a lot here, I know. It took me almost a year to understand TAA. It's new and different. And it doesn't always align with popular beliefs.\n\nSo, this is my challenge: **How can I best share this strategy so everyone benefits?**\n<br>\n<br>\n\n## Expanding the analogy \n\nDerek Thompson, one of my [favorite podcasters](https://podcasts.apple.com/us/podcast/plain-english-with-derek-thompson/id1594471023), speaks in analogies. \n\nIt can help new ideas stick. So let me try one.\n\nI think of Buy & Hold investing like that ride on a roller coaster. \n\n<img src=\"https://fastfollowinvestor.com/uploads/2022/424c3e28f2.png\" width=\"600\" height=\"349\" alt=\"\" />\n<br>\n\nA roller coaster entertains riders with steep climbs and steeper drops. \n\nYou must put your trust in the ride because you have no control. \n\nFor long stretches, there is a lot of up and down, but you make no vertical progress. \n\nBut, riding is easy. You get on the ride and go (think: set it and forget it).\n<br>\n<br>\n\nTactical Asset Allocation (TAA) is more like a mountain trek.\n\n<img src=\"https://fastfollowinvestor.com/uploads/2022/c180f5ae4e.png\" width=\"600\" height=\"368\" alt=\"\" />\n<br>\n\nHiking a mountain takes preparation and, sometimes, training. \n\nYou choose your path, and so control your destiny. \n\nWhile you may need to backtrack, it's minimal if you plan your route well. \n\nWhen you reach the summit, you're exhausted but feel great given the achievement.  \n<br>\n<br>\n\n## Use both for strong diversification\n\n**Buy & Hold and TAA are valid investing strategies.**\n\nYou can expect positive returns from both. But, one may work better than the other in certain situations. \n\nOne obvious use case: the new saver has time to reap rewards from Buy & Hold.  The soon-to-be retiree does not have the time and should tilt her/his portfolio toward TAA.\n\n**Buy & Hold and TAA are excellent diversifying strategies.**\n \nTogether, they reduce your portfolio's overall volatility and don't dilute investment returns. Diversification, not diworsification. \n\nAnd how fortunate this is! Take a small piece of your Buy & Hold portfolio and try it out. Dipping your toe in the TAA waters is a good way to learn something new and manage risk at the same time.\n<br>\n<br>\n\nWhen you're ready for more, you can watch my trades monthly in real-time at [FastFollowInvestor.com](https://fastfollowinvestor.com/invest-like-me/).\n<br>\n<br>\n[Subscribe](https://fastfollowinvestor.com/subscribe/) to get my posts sent to your Inbox.\n",
				"date_published": "2023-01-24T08:54:25-08:00",
				"url": "https://fastfollowinvestor.com/2022/12/23/buy-hold-investing.html",
				"tags": ["money and markets"]
			},
			{
				"id": "http://brianh.micro.blog/2022/12/31/my-first-trades.html",
				"title": "My first trades of 2023 are in!",
				"content_html": "<p>On January 3, my Fast Follow Investor (FFI) model made some portfolio adjustments:\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"january-2023-allocations\">January 2023 Allocations</h2>\n<ul>\n<li>~35% International equities (tickers SCZ, VGK)</li>\n<li>~25% Gold and commodities (tickers GLD, DBC)</li>\n<li>~40% Cash</li>\n</ul>\n<p>A &ldquo;Santa Rally&rdquo; never materialized, and December was a down month for U.S. equities. The S&amp;P 500 was down over 2.5%. The Nasdaq ended down almost 5%. Fortunately, I held only a 3.3% position in U.S. equities.</p>\n<p>The FFI portfolio was up and down all month, closing the month down 0.3%.</p>\n<p>Most January portfolio adjustments were minor tweaks.</p>\n<p>The most significant change:\nFFI&rsquo;s cash position increased by 15% after reducing my investment in one international equity ETF (EFA).\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"my-2022-performance\">My 2022 Performance</h2>\n<p>For most, 2022 was a difficult (and down) year. It was no different for the Fast Follow Investor portfolio. 2022 ended down 13.1%.</p>\n<p>The only good news, if you can call it that, is the standard 60% stock/40% bond portfolio was down 17.6% for 2022.</p>\n<p>So, yes, the FFI portfolio fared 26% better. It&rsquo;s nothing to write home about. But, it does reflect the downside risk protection that Tactical Asset Allocation offers.</p>\n<p>When the markets do recover, growth will compound from a higher low. This is rewarding over the long term.</p>\n<p>And always remember:\nThe FFI portfolio will never be the top-performing investment strategy in a given year. By design, it cannot be since we wait for an uptrend to buy back in.</p>\n<p>Yet, many <a href=\"https://fastfollowinvestor.com/2022/12/12/what-is-behind.html\">2nd and 3rd place finishes</a> added up make for staggering and consistent success.\n<!-- raw HTML omitted --></p>\n<p>If you know someone who could learn from my monthly investments or commentary, please point them to <a href=\"https://fastfollowinvestor.com/\">fastfollowinvestor.com</a>.</p>\n<p>Thanks!\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>This offer is in no way financial advice. Rather, it is very important financial education!</p>\n",
				"content_text": "On January 3, my Fast Follow Investor (FFI) model made some portfolio adjustments:\n<br>\n<br>\n\n## January 2023 Allocations\n\n* ~35% International equities (tickers SCZ, VGK)\n* ~25% Gold and commodities (tickers GLD, DBC)\n* ~40% Cash\n\nA \"Santa Rally\" never materialized, and December was a down month for U.S. equities. The S&P 500 was down over 2.5%. The Nasdaq ended down almost 5%. Fortunately, I held only a 3.3% position in U.S. equities. \n\nThe FFI portfolio was up and down all month, closing the month down 0.3%. \n\nMost January portfolio adjustments were minor tweaks. \n\nThe most significant change:\nFFI's cash position increased by 15% after reducing my investment in one international equity ETF (EFA).\n<br>\n<br> \n\n## My 2022 Performance\n\nFor most, 2022 was a difficult (and down) year. It was no different for the Fast Follow Investor portfolio. 2022 ended down 13.1%.\n\nThe only good news, if you can call it that, is the standard 60% stock/40% bond portfolio was down 17.6% for 2022.\n\nSo, yes, the FFI portfolio fared 26% better. It's nothing to write home about. But, it does reflect the downside risk protection that Tactical Asset Allocation offers. \n\nWhen the markets do recover, growth will compound from a higher low. This is rewarding over the long term.\n\nAnd always remember:\nThe FFI portfolio will never be the top-performing investment strategy in a given year. By design, it cannot be since we wait for an uptrend to buy back in. \n\nYet, many [2nd and 3rd place finishes](https://fastfollowinvestor.com/2022/12/12/what-is-behind.html) added up make for staggering and consistent success.\n<br>\n\nIf you know someone who could learn from my monthly investments or commentary, please point them to [fastfollowinvestor.com](https://fastfollowinvestor.com/).\n\nThanks!\n<br>\n<br> \n\nThis offer is in no way financial advice. Rather, it is very important financial education!\n",
				"date_published": "2023-01-15T10:30:32-08:00",
				"url": "https://fastfollowinvestor.com/2022/12/31/my-first-trades.html",
				"tags": ["money and markets"]
			},
			{
				"id": "http://brianh.micro.blog/2023/01/06/what-i-learned.html",
				"title": "What I learned in the ten years since my \"Marissa Mayer moment\"",
				"content_html": "<p>Today is my birthday!</p>\n<p>I am made fun of for broadening its celebration. My birthday becomes my &ldquo;birthday weekend&rdquo;, my &ldquo;birthday week&rdquo;, and even my &ldquo;birthday month&rdquo;. I don&rsquo;t know why I do this. I just love my birthday.</p>\n<p>Birthdays are wonderful days to reflect on your life: What have I accomplished? <a href=\"https://fastfollowinvestor.com/about/\">Who am I now</a>?</p>\n<p>I&rsquo;d love to tell you about my &ldquo;Marissa Mayer Moment&rdquo;.</p>\n<p>In July 2012, I was six months into a new job. My first as a director! I was commuting 2.5 hrs per day. Waking up nightly to care for a 1-year-old. I was working hard, but managing it all pretty well&hellip; I thought.</p>\n<p>Then Yahoo! named Marissa Mayer its CEO. We were both 37 yrs old.</p>\n<p>I looked up her background. Marissa graduated high school in 1993 in Wausau, Wisconsin. This is only 100 miles from where I grew up, in rural Ripon, Wisconsin.</p>\n<p>So, in late 1993, we both took off to school&hellip;and now she was the CEO of Yahoo!. It took her only 15 years after college.</p>\n<p>It was the first time something shocked me out of the daily corporate grind: What am I doing with my career? What am I working toward? Is this a mid-life crisis?</p>\n<p>My wife laughs at me: &ldquo;That was the first time?&rdquo;.</p>\n<p>It&rsquo;s crazy to think that was 10 years ago. In those 10 years, I decided to jump off the corporate track. I have been able to start a couple of (small) businesses and lead a relatively stress-free life. I like it. It fits me.</p>\n<p>I google Marissa now and again. I see pics of what looks like a pretty normal life. And maybe we&rsquo;re not so different. I mean, apart from her fame and the $ Millions&hellip; ;-)</p>\n<p>P.S. Marissa Mayer- please don&rsquo;t misunderstand me. You&rsquo;re awesome!\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<a href=\"https://fastfollowinvestor.com/subscribe/\">Subscribe</a> to get my posts sent to your Inbox.</p>\n",
				"content_text": "Today is my birthday!\n\nI am made fun of for broadening its celebration. My birthday becomes my \"birthday weekend\", my \"birthday week\", and even my \"birthday month\". I don't know why I do this. I just love my birthday. \n\nBirthdays are wonderful days to reflect on your life: What have I accomplished? [Who am I now](https://fastfollowinvestor.com/about/)?\n\nI'd love to tell you about my \"Marissa Mayer Moment\".\n\nIn July 2012, I was six months into a new job. My first as a director! I was commuting 2.5 hrs per day. Waking up nightly to care for a 1-year-old. I was working hard, but managing it all pretty well... I thought.\n\nThen Yahoo! named Marissa Mayer its CEO. We were both 37 yrs old.\n\nI looked up her background. Marissa graduated high school in 1993 in Wausau, Wisconsin. This is only 100 miles from where I grew up, in rural Ripon, Wisconsin.\n\nSo, in late 1993, we both took off to school...and now she was the CEO of Yahoo!. It took her only 15 years after college.\n\nIt was the first time something shocked me out of the daily corporate grind: What am I doing with my career? What am I working toward? Is this a mid-life crisis? \n\nMy wife laughs at me: \"That was the first time?\".\n\nIt's crazy to think that was 10 years ago. In those 10 years, I decided to jump off the corporate track. I have been able to start a couple of (small) businesses and lead a relatively stress-free life. I like it. It fits me.\n\nI google Marissa now and again. I see pics of what looks like a pretty normal life. And maybe we're not so different. I mean, apart from her fame and the $ Millions... ;-)\n\n\nP.S. Marissa Mayer- please don't misunderstand me. You're awesome!\n<br>\n<br>\n<br>\n[Subscribe](https://fastfollowinvestor.com/subscribe/) to get my posts sent to your Inbox.\n",
				"date_published": "2023-01-08T13:43:27-08:00",
				"url": "https://fastfollowinvestor.com/2023/01/06/what-i-learned.html",
				"tags": ["on life"]
			},
			{
				"id": "http://brianh.micro.blog/2022/12/28/a-new-year.html",
				"title": "A new year brings new opportunity! Do this one thing to take advantage...",
				"content_html": "<p><strong>Spend one weekend alone to make plans for a full and well-intentioned life.</strong>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<!-- raw HTML omitted -->\n<p><em>In 2022, I spent a December weekend in Alameda&rsquo;s beautiful Gold Coast neighborhood.</em>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>What started during COVID as a need for some &ldquo;me time&rdquo; has become an important, life planning event.</p>\n<p>Some do it at the turn of the year. Others do it close to their birthday. My birthday is January 8, so I guess I do both!</p>\n<p>I spent a recent December weekend at a local Airbnb reflecting on 2022 and making plans for 2023.</p>\n<p>It was an entire weekend for me. An entire weekend not stuck in the daily grind. An entire weekend spent appreciating 2022 and dreaming about 2023.</p>\n<p>Think of it as a strategic planning offsite&hellip;for you.</p>\n<p>I recommend you do it.</p>\n<p>Now in my 3rd year, I have insights.</p>\n<p>One insight I didn&rsquo;t expect is how the weekend helps me segment years. Before taking my annual trip, the years ran together.</p>\n<p>Now, my life has chapters. The chapters help me fight time which has accelerated as I age. How is my son 11 years old, already?</p>\n<p>My second insight tackles how to make the trip&rsquo;s significance stick.</p>\n<p>I propose keeping your life&rsquo;s plan for the year simple. I prepare 4-5 goals for the year in a Word document. You might even choose to handwrite your plan.</p>\n<p>Either way, make a hard copy and display it at your desk. Don&rsquo;t tuck away your life goals for the year!</p>\n<p>Please feel free to use my template. I call it my &ldquo;One Year at-a-time Life Planner&rdquo;. You can download it <a href=\"https://fastfollowinvestor.com/free-resources/\">here</a>.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<!-- raw HTML omitted -->\n<p><em>My life&rsquo;s 46th chapter (2022) started at this humble Airbnb in Forestville, CA.</em>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>And one final insight. I find it helpful to create a personal theme for the year. For example, looking back&hellip;</p>\n<p>My 2021 theme was <strong>Lay a solid personal financial groundwork.</strong>\nThis translated to 1) Prepare a wealth plan, 2) Learn to invest better, and 3) Become tax efficient.</p>\n<p>My 2022 theme was <strong>Simplify life by targeting the best opportunities.</strong>\nThis translated to 1) Work on the right things and 2) Keep stress-levels low.</p>\n<p>Looking ahead, my theme for 2023 is <strong>Live a full life and try out retirement.</strong>\nOur family is making a concerted effort to do new and memorable things. I&rsquo;m going to take some time off work.</p>\n<p>Happy planning! Here&rsquo;s to a great 2023!\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>You can grab my &ldquo;One Year at-a-time Life Planner&rdquo; and some other freebies <a href=\"https://fastfollowinvestor.com/free-resources/\">here</a>.</p>\n<!-- raw HTML omitted -->\n<p><a href=\"https://fastfollowinvestor.com/subscribe/\">Subscribe</a> to get my posts sent to your Inbox.</p>\n",
				"content_text": "**Spend one weekend alone to make plans for a full and well-intentioned life.**\n<br>\n<br>\n\n<img src=\"https://fastfollowinvestor.com/uploads/2022/3e697c9246.png\" width=\"600\" height=\"297\" alt=\"\" />\n\n_In 2022, I spent a December weekend in Alameda's beautiful Gold Coast neighborhood._\n<br>\n<br>\n\nWhat started during COVID as a need for some \"me time\" has become an important, life planning event. \n\nSome do it at the turn of the year. Others do it close to their birthday. My birthday is January 8, so I guess I do both!\n\nI spent a recent December weekend at a local Airbnb reflecting on 2022 and making plans for 2023.\n\nIt was an entire weekend for me. An entire weekend not stuck in the daily grind. An entire weekend spent appreciating 2022 and dreaming about 2023.\n\nThink of it as a strategic planning offsite...for you. \n \nI recommend you do it.\n\nNow in my 3rd year, I have insights. \n\nOne insight I didn't expect is how the weekend helps me segment years. Before taking my annual trip, the years ran together.\n\nNow, my life has chapters. The chapters help me fight time which has accelerated as I age. How is my son 11 years old, already?\n\nMy second insight tackles how to make the trip's significance stick. \n\nI propose keeping your life's plan for the year simple. I prepare 4-5 goals for the year in a Word document. You might even choose to handwrite your plan. \n\nEither way, make a hard copy and display it at your desk. Don't tuck away your life goals for the year! \n\nPlease feel free to use my template. I call it my \"One Year at-a-time Life Planner\". You can download it [here](https://fastfollowinvestor.com/free-resources/). \n<br>\n<br>\n\n<img src=\"https://fastfollowinvestor.com/uploads/2022/1ef2e1ed88.png\" width=\"600\" height=\"297\" alt=\"\" />\n\n_My life's 46th chapter (2022) started at this humble Airbnb in Forestville, CA._\n<br>\n<br>\n\nAnd one final insight. I find it helpful to create a personal theme for the year. For example, looking back...\n\nMy 2021 theme was **Lay a solid personal financial groundwork.**\nThis translated to 1) Prepare a wealth plan, 2) Learn to invest better, and 3) Become tax efficient.\n\nMy 2022 theme was **Simplify life by targeting the best opportunities.**\nThis translated to 1) Work on the right things and 2) Keep stress-levels low.\n\nLooking ahead, my theme for 2023 is **Live a full life and try out retirement.**\nOur family is making a concerted effort to do new and memorable things. I'm going to take some time off work.\n\nHappy planning! Here's to a great 2023!\n<br>\n<br>\n\nYou can grab my \"One Year at-a-time Life Planner\" and some other freebies [here](https://fastfollowinvestor.com/free-resources/).\n\n<img src=\"https://fastfollowinvestor.com/uploads/2022/f3f48db0d4.png\" width=\"600\" height=\"487\" alt=\"\" />\n<br>\n<br>\n\n[Subscribe](https://fastfollowinvestor.com/subscribe/) to get my posts sent to your Inbox.\n",
				"date_published": "2023-01-03T11:51:44-08:00",
				"url": "https://fastfollowinvestor.com/2022/12/28/a-new-year.html",
				"tags": ["on life","money and markets"]
			},
			{
				"id": "http://brianh.micro.blog/2022/12/20/use-this-x.html",
				"title": "Use this 2x2 matrix to learn which investments will shine this year",
				"content_html": "<p><em>In the past 40 years, we&rsquo;ve seen only two types of U.S. economy. A new and different economy could be right around the corner. What is it?</em></p>\n<!-- raw HTML omitted -->\n<p>If you&rsquo;re familiar with San Franciso, you&rsquo;re familiar with microclimates.</p>\n<p>On a summer day, it may be 55 deg. in the City, 75 deg. in Alameda (where I live), and 95. deg in Concord (where my son goes to school).</p>\n<p>It&rsquo;s no wonder that the #1 memento for a San Francisco tourist is a sweatshirt. You think California summer, and you think hot. Nope. Fog covers the City, pulled on shore by the Bay Area&rsquo;s inland heat. And it&rsquo;s cold.</p>\n<p>The simple lesson? Be ready for all kinds of weather.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"all-weather-investing-portfolios\">All weather investing portfolios</h2>\n<p>This analogy has infiltrated investment-speak over the years.</p>\n<p>The most direct is Ray Dalio&rsquo;s All Weather investment portfolio (1996).\nIt holds roughly 30% stocks, 40% long-term bonds, 15% short-term bonds, 7.5% gold, and 7.5% commodities.</p>\n<p>Other examples:</p>\n<ul>\n<li>Permanent portfolio (1982) from Harry Browne, holding 25% stocks, 25% long-term bonds, 25% cash, and 25% gold.</li>\n<li>Dragon portfolio (2020) from Chris Cole. It holds 20% stocks, 20% long-term bonds, 20% gold, 20% commodity trend, and 20% long volatility.</li>\n</ul>\n<p>If this post is getting complicated fast for you, do not worry.</p>\n<p>I name these investment portfolios for one reason. Smart investors with <a href=\"https://fastfollowinvestor.com/2022/12/15/what-eddie-izzard.html\">very long investment horizons</a> consider all types of U.S. economies. Or as I will call them: economic regimes.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"what-are-the-four-economic-regimes\">What are the four economic regimes?</h2>\n<p>Economic regimes depend on two factors that interact: Growth and Inflation.</p>\n<p>If we match levels of Growth (positive or negative) with Inflation (yes or no), we arrive at four economic regimes:</p>\n<ul>\n<li>Expansion (real): economic growth and no price inflation</li>\n<li>Expansion (nominal): economic growth with price inflation</li>\n<li>Recession: economic decline and no price inflation</li>\n<li>Stagflation: economic decline with price inflation</li>\n</ul>\n<p>Assessing recent history:</p>\n<ul>\n<li>For the last ~40 years (1980 to 2021), we&rsquo;ve swung between expansion (real) and recession.</li>\n<li>2021/2 included 18 months of expansion (nominal-with inflation).</li>\n<li>And, as we look to 2023, we are teetering between continued expansion (nominal) and stagflation.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></li>\n</ul>\n<h2 id=\"why-is-this-important\">Why is this important?</h2>\n<p>Consider these questions:</p>\n<ol>\n<li>What type of investments work best in expansionary times? Stocks.</li>\n<li>How about in recessions? Bonds.</li>\n</ol>\n<p>This is good: We have access to stocks and bonds in our 401Ks, IRAs, and brokerage accounts.</p>\n<ol start=\"3\">\n<li>What about expansionary times with inflation? Stocks, yes, but also (and more so) commodities!</li>\n<li>How about during stagflation? Commodities again. And gold.</li>\n</ol>\n<p><strong>This is a problem! Most investors can&rsquo;t access commodities and gold as investments.</strong></p>\n<p>Inflation really messes things up. If it sticks around, we need alternatives to stocks and bonds for continued investment success.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"your-easy-to-understand-2x2-matrix\">Your easy-to-understand 2x2 matrix</h2>\n<p>In my 20s, I worked for a manager who looked at life through 2x2 matrices. Every situation. Every decision. Everything could be framed by a 2x2.</p>\n<p>Well, so can economic regimes.</p>\n<p>The four quadrants that define our four economic regimes are defined here:</p>\n<!-- raw HTML omitted -->\n<p>For those interested in my research, here is a link to the key chart.</p>\n<!-- raw HTML omitted -->\n<p>And for even more excruciating details, refer to <a href=\"https://mcusercontent.com/6750faf5c6091bc898da154ff/files/006447b8-279d-8aed-22b6-cde5a5b2e61d/20221103.IF.Multi_AssetInflatonDeck.BBG.pdf\">this</a>.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"all-weather-portfolios-make-a-comeback\">All Weather portfolios make a comeback</h2>\n<p>I mentioned early on that several all-weather portfolios do exist.\nBut few know about them, for these reasons:</p>\n<ul>\n<li>They have been out of favor because they have underperformed. We&rsquo;ve experienced zero inflation in the past 40 years. So, commodities and gold have been a drag on investment returns.</li>\n<li>We aren&rsquo;t educated on all-weather portfolios. The mutual fund industry -and the stock/bond funds it touts- has grown massively in the last 40 years. And this aligns with just two of four economic regimes. <a href=\"https://fastfollowinvestor.com/2022/12/15/what-eddie-izzard.html\">Our own short-term thinking limits us</a>.</li>\n<li>Until recently, portfolios with commodities and gold have been hard to set up. Only hedge funds, family offices, and other &ldquo;big money&rdquo; played in these assets.\n<!-- raw HTML omitted --></li>\n</ul>\n<p>Portfolios that accommodate all economic regimes may have been out of favor for 40 years. But, they may soon make a comeback.</p>\n<p>2022 and 2023 appear to be years of economic change. It&rsquo;s time to learn more!</p>\n<p>And, wouldn&rsquo;t it be cool if there was a more fluid all-weather portfolio?</p>\n<p>What if you could move money to the best performers when economic regimes changed?</p>\n<p>That&rsquo;s what I do at <a href=\"https://fastfollowinvestor.com/invest-like-me/\">fastfollowinvestor.com</a>.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p><a href=\"https://fastfollowinvestor.com/subscribe/\">Subscribe</a> to get my posts sent to your Inbox.</p>\n",
				"content_text": "_In the past 40 years, we've seen only two types of U.S. economy. A new and different economy could be right around the corner. What is it?_\n\n<img src=\"https://fastfollowinvestor.com/uploads/2022/6113699a9d.png\" width=\"600\" height=\"597\" alt=\"\" />\n<br>\n\nIf you're familiar with San Franciso, you're familiar with microclimates. \n\nOn a summer day, it may be 55 deg. in the City, 75 deg. in Alameda (where I live), and 95. deg in Concord (where my son goes to school).\n\nIt's no wonder that the #1 memento for a San Francisco tourist is a sweatshirt. You think California summer, and you think hot. Nope. Fog covers the City, pulled on shore by the Bay Area's inland heat. And it's cold.\n\nThe simple lesson? Be ready for all kinds of weather.\n<br>\n<br>\n\n## All weather investing portfolios\n\nThis analogy has infiltrated investment-speak over the years.\n\nThe most direct is Ray Dalio's All Weather investment portfolio (1996). \nIt holds roughly 30% stocks, 40% long-term bonds, 15% short-term bonds, 7.5% gold, and 7.5% commodities.\n\nOther examples:\n\n* Permanent portfolio (1982) from Harry Browne, holding 25% stocks, 25% long-term bonds, 25% cash, and 25% gold.\n* Dragon portfolio (2020) from Chris Cole. It holds 20% stocks, 20% long-term bonds, 20% gold, 20% commodity trend, and 20% long volatility.\n\nIf this post is getting complicated fast for you, do not worry. \n\nI name these investment portfolios for one reason. Smart investors with [very long investment horizons](https://fastfollowinvestor.com/2022/12/15/what-eddie-izzard.html) consider all types of U.S. economies. Or as I will call them: economic regimes.\n<br>\n<br>\n\n## What are the four economic regimes?\n\nEconomic regimes depend on two factors that interact: Growth and Inflation. \n\nIf we match levels of Growth (positive or negative) with Inflation (yes or no), we arrive at four economic regimes:\n\n* Expansion (real): economic growth and no price inflation\n* Expansion (nominal): economic growth with price inflation\n* Recession: economic decline and no price inflation\n* Stagflation: economic decline with price inflation\n\nAssessing recent history:\n\n* For the last ~40 years (1980 to 2021), we've swung between expansion (real) and recession.\n* 2021/2 included 18 months of expansion (nominal-with inflation).\n* And, as we look to 2023, we are teetering between continued expansion (nominal) and stagflation.\n<br>\n<br>\n\n## Why is this important?\n\nConsider these questions: \n\n1. What type of investments work best in expansionary times? Stocks. \n2. How about in recessions? Bonds.\n\nThis is good: We have access to stocks and bonds in our 401Ks, IRAs, and brokerage accounts.\n\n3. What about expansionary times with inflation? Stocks, yes, but also (and more so) commodities!\n4. How about during stagflation? Commodities again. And gold.\n\n\n**This is a problem! Most investors can't access commodities and gold as investments.**\n\nInflation really messes things up. If it sticks around, we need alternatives to stocks and bonds for continued investment success.\n<br>\n<br>\n\n## Your easy-to-understand 2x2 matrix\n\nIn my 20s, I worked for a manager who looked at life through 2x2 matrices. Every situation. Every decision. Everything could be framed by a 2x2.\n\nWell, so can economic regimes.\n\nThe four quadrants that define our four economic regimes are defined here:\n\n<img src=\"https://fastfollowinvestor.com/uploads/2022/db174837dc.png\" width=\"600\" height=\"179\" alt=\"\" />\n<br>\n\nFor those interested in my research, here is a link to the key chart.\n \n<img src=\"https://fastfollowinvestor.com/uploads/2022/82ab175552.png\" width=\"600\" height=\"412\" alt=\"\" />\n<br>\n\nAnd for even more excruciating details, refer to [this]( https://mcusercontent.com/6750faf5c6091bc898da154ff/files/006447b8-279d-8aed-22b6-cde5a5b2e61d/20221103.IF.Multi_AssetInflatonDeck.BBG.pdf ). \n<br>\n<br>\n\n## All Weather portfolios make a comeback\n\nI mentioned early on that several all-weather portfolios do exist.\nBut few know about them, for these reasons:\n\n* They have been out of favor because they have underperformed. We've experienced zero inflation in the past 40 years. So, commodities and gold have been a drag on investment returns.\n* We aren't educated on all-weather portfolios. The mutual fund industry -and the stock/bond funds it touts- has grown massively in the last 40 years. And this aligns with just two of four economic regimes. [Our own short-term thinking limits us](https://fastfollowinvestor.com/2022/12/15/what-eddie-izzard.html).\n* Until recently, portfolios with commodities and gold have been hard to set up. Only hedge funds, family offices, and other \"big money\" played in these assets.\n<br>\n \nPortfolios that accommodate all economic regimes may have been out of favor for 40 years. But, they may soon make a comeback.\n\n2022 and 2023 appear to be years of economic change. It's time to learn more!\n\nAnd, wouldn't it be cool if there was a more fluid all-weather portfolio? \n\nWhat if you could move money to the best performers when economic regimes changed?\n\nThat's what I do at [fastfollowinvestor.com](https://fastfollowinvestor.com/invest-like-me/).\n<br>\n<br>\n\n[Subscribe](https://fastfollowinvestor.com/subscribe/) to get my posts sent to your Inbox.\n",
				"date_published": "2022-12-27T10:45:20-08:00",
				"url": "https://fastfollowinvestor.com/2022/12/20/use-this-x.html",
				"tags": ["money and markets"]
			},
			{
				"id": "http://brianh.micro.blog/2022/12/15/what-eddie-izzard.html",
				"title": "What Eddie Izzard taught me about investing for the long-term",
				"content_html": "<p><em>Humans are not wired to think long-term; yet it&rsquo;s required to invest well.</em>\n<!-- raw HTML omitted --></p>\n<!-- raw HTML omitted -->\n<p>Eddie Izzard, of stand-up, film, and TV fame, quips that:</p>\n<p>&ldquo;He grew up in Europe, where the history comes from.&rdquo;</p>\n<p>Like Eddie, I find it difficult for Americans to grasp &ldquo;long-term&rdquo;. We&rsquo;re a young country. Our history is short. It&rsquo;s not a bad thing&hellip; simply a fact.</p>\n<p>Later in his bit, Eddie cites a story on TV during a recent hotel stay:</p>\n<p>&ldquo;We&rsquo;ve redecorated this Miami building to how it looked over 50 years ago.&rdquo;</p>\n<p>You have to see it <a href=\"https://www.youtube.com/watch?v=J6hijsqO8H0\">here</a>.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"what-is-long-term\">What is long-term?</h2>\n<p>Is 50 years long-term? Not to the <a href=\"https://longnow.org/\">Long Now Foundation</a>.</p>\n<p>From its website:</p>\n<blockquote>\n<p>The Long Now Foundation is a nonprofit established in 01996 to foster long-term thinking.\nOur work encourages imagination at the timescale of civilization — the next and last 10,000 years — a timespan we call the <em>long now</em>.\n<!-- raw HTML omitted --></p>\n</blockquote>\n<p>Contrast the long now with:</p>\n<ul>\n<li><em>now</em> (3 days)</li>\n<li><em>nowadays</em> (3 decades)</li>\n</ul>\n<p>I like these definitions. And <em>nowadays</em> is all that the human mind can consider comfortably.</p>\n<p>I remember 20 years ago: leaving grad school, getting married, and moving to San Franciso.</p>\n<p>I can imagine 10 years from now: my son graduates college, I&rsquo;m working part-time, and traveling in Europe.</p>\n<p>Try it yourself. Pushing beyond a 30-year window is difficult.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"longest-standing-businesses\">Longest standing businesses</h2>\n<p>If asked to name a long-standing business, the first that comes to mind for me is General Electric.</p>\n<p>GE launched in 1892. It&rsquo;s 130 years old.</p>\n<p>Not many make it that long. It&rsquo;s quite impressive, as GE is having its own issues right now.</p>\n<p>But, 130 years is nothing.</p>\n<p>Staffelter Hof Winery in Krov, Germany opened in 862.</p>\n<p>That&rsquo;s 1,160 years ago!</p>\n<p>I find it hard to wrap my head around that. The winery has been around for ~45 generations.</p>\n<p>For a list of the oldest business still operating, check out this <a href=\"https://businessfinancing.co.uk/the-oldest-company-in-almost-every-country/\">site</a>.</p>\n<p>Of the oldest companies, the industries with the greatest longevity:</p>\n<ul>\n<li>Banking (36)</li>\n<li>Alcohol (18)</li>\n<li>Postal services (16)</li>\n</ul>\n<p>Money, drinking, and communication. In that order. That seems about right.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"what-this-means-for-investing\">What this means for investing</h2>\n<p>Experiences from our own adult lifetimes influence how we invest.</p>\n<p>Take me. I started investing in 1997, the year I got my first real job.</p>\n<p>My biases (good and bad) stem from the period 15 years prior, when the finance books I read were written, through now.</p>\n<p>As a whole, 1982-2022 has been a period of strong growth, low inflation, and a helpful Federal Reserve enabling asset growth.</p>\n<p>Stocks and bonds have performed well.</p>\n<p>But what if I was born 40 years earlier, in 1936?</p>\n<p>A look into the more distant past shows a very different situation. Economic depression, war, and high inflation.</p>\n<p>What performed well then? Real assets like gold bars, oil, and other commodity products.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"the-key-takeaways\">The key takeaways</h2>\n<ul>\n<li>The human mind is challenged to comprehend time beyond <em>nowadays</em> (30 years).</li>\n<li>Economic regimes are long (the current one is 40 years) and slow-moving. They trick us into thinking the current one will last forever.</li>\n<li>The truth is, we can&rsquo;t predict what investment will always perform well. It&rsquo;s because we can&rsquo;t predict when an economic regime will change.</li>\n<li>And a lot of bad things can happen. When you expand your frame of reference to 1,000 or even 10,000 years, &ldquo;once in a lifetime&rdquo;-type events happen all the time.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></li>\n</ul>\n<p>As Eddie Izzard points out in jest, we must elongate our thinking.</p>\n<p>And we must translate that long-term thinking into how we invest.</p>\n<p>A lot of bad things can happen over the course of many lifetimes.</p>\n<p>This means we need to weather a lot of tragedy within our investment approach.</p>\n<p>Don&rsquo;t fret. In my <a href=\"https://fastfollowinvestor.com/2022/12/20/use-this-x.html\">next post</a>, I&rsquo;ll share how we can do just that. I&rsquo;ll help you keep your investments performing well throughout your lifetime and beyond.</p>\n<p>And the solution is far easier than starting a German winery&hellip; which is good news for those of us who don&rsquo;t live in Germany.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p><a href=\"https://fastfollowinvestor.com/subscribe/\">Subscribe</a> to get my posts sent to your Inbox.</p>\n",
				"content_text": "_Humans are not wired to think long-term; yet it's required to invest well._\n<br>\n\n<img src=\"https://fastfollowinvestor.com/uploads/2022/c9337edfa8.jpg\" width=\"600\" height=\"451\" alt=\"\" />\n<br>\n<br>\n\nEddie Izzard, of stand-up, film, and TV fame, quips that: \n\n\"He grew up in Europe, where the history comes from.\"\n\nLike Eddie, I find it difficult for Americans to grasp \"long-term\". We're a young country. Our history is short. It's not a bad thing... simply a fact.\n\nLater in his bit, Eddie cites a story on TV during a recent hotel stay:\n\n\"We've redecorated this Miami building to how it looked over 50 years ago.\"\n \nYou have to see it [here](https://www.youtube.com/watch?v=J6hijsqO8H0).\n<br>\n<br>\n\n## What is long-term?\n\nIs 50 years long-term? Not to the [Long Now Foundation]( https://longnow.org/).\n\nFrom its website: \n\n> The Long Now Foundation is a nonprofit established in 01996 to foster long-term thinking.\n> Our work encourages imagination at the timescale of civilization — the next and last 10,000 years — a timespan we call the _long now_.\n<br>\n\nContrast the long now with:\n\n* _now_ (3 days)\n* _nowadays_ (3 decades)\n\nI like these definitions. And _nowadays_ is all that the human mind can consider comfortably. \n\nI remember 20 years ago: leaving grad school, getting married, and moving to San Franciso.\n\nI can imagine 10 years from now: my son graduates college, I'm working part-time, and traveling in Europe.\n\nTry it yourself. Pushing beyond a 30-year window is difficult.\n<br>\n<br>\n\n## Longest standing businesses\n\nIf asked to name a long-standing business, the first that comes to mind for me is General Electric. \n\nGE launched in 1892. It's 130 years old. \n\nNot many make it that long. It's quite impressive, as GE is having its own issues right now.\n\nBut, 130 years is nothing.\n\nStaffelter Hof Winery in Krov, Germany opened in 862.\n\nThat's 1,160 years ago! \n\nI find it hard to wrap my head around that. The winery has been around for ~45 generations.\n\nFor a list of the oldest business still operating, check out this [site](https://businessfinancing.co.uk/the-oldest-company-in-almost-every-country/).\n\nOf the oldest companies, the industries with the greatest longevity:\n\n* Banking (36)\n* Alcohol (18)\n* Postal services (16)\n\nMoney, drinking, and communication. In that order. That seems about right.\n<br>\n<br>\n\n## What this means for investing \n \nExperiences from our own adult lifetimes influence how we invest.\n\nTake me. I started investing in 1997, the year I got my first real job.\n\nMy biases (good and bad) stem from the period 15 years prior, when the finance books I read were written, through now.\n\nAs a whole, 1982-2022 has been a period of strong growth, low inflation, and a helpful Federal Reserve enabling asset growth.\n\nStocks and bonds have performed well.\n\nBut what if I was born 40 years earlier, in 1936? \n\nA look into the more distant past shows a very different situation. Economic depression, war, and high inflation. \n\nWhat performed well then? Real assets like gold bars, oil, and other commodity products.\n<br>\n<br>\n \n## The key takeaways\n\n* The human mind is challenged to comprehend time beyond _nowadays_ (30 years).\n* Economic regimes are long (the current one is 40 years) and slow-moving. They trick us into thinking the current one will last forever.\n* The truth is, we can't predict what investment will always perform well. It's because we can't predict when an economic regime will change.\n* And a lot of bad things can happen. When you expand your frame of reference to 1,000 or even 10,000 years, \"once in a lifetime\"-type events happen all the time.\n<br>\n<br>\n\nAs Eddie Izzard points out in jest, we must elongate our thinking.\n\nAnd we must translate that long-term thinking into how we invest.\n\nA lot of bad things can happen over the course of many lifetimes. \n\nThis means we need to weather a lot of tragedy within our investment approach.\n\nDon't fret. In my [next post](https://fastfollowinvestor.com/2022/12/20/use-this-x.html), I'll share how we can do just that. I'll help you keep your investments performing well throughout your lifetime and beyond.\n\nAnd the solution is far easier than starting a German winery... which is good news for those of us who don't live in Germany.\n<br>\n<br>\n\n[Subscribe](https://fastfollowinvestor.com/subscribe/) to get my posts sent to your Inbox.\n",
				"date_published": "2022-12-17T13:14:13-08:00",
				"url": "https://fastfollowinvestor.com/2022/12/15/what-eddie-izzard.html",
				"tags": ["money and markets"]
			},
			{
				"id": "http://brianh.micro.blog/2022/12/12/what-is-behind.html",
				"title": "What is behind the name FastFollowInvestor.com?",
				"content_html": "<p><em>If you&rsquo;re curious, here&rsquo;s my thinking about the name and logo (or should I say mascot).</em>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<!-- raw HTML omitted -->\n<h2 id=\"fast-follower-technology\">Fast Follower Technology</h2>\n<p>The &ldquo;fast follower&rdquo; in the name stems from the technology strategy.</p>\n<p>A fast follower is not an innovator.</p>\n<p>But when innovation takes off, the fast follower quickly jumps in.</p>\n<p>The master of this is Microsoft. Its success speaks for itself.</p>\n<p>Microsoft has been in the top 3 in market capitalization for over 20 years.</p>\n<p>No other company can match it.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<!-- raw HTML omitted -->\n<p>Credit <a href=\"https://www.visualcapitalist.com/cp/largest-companies-from-2000-to-2022/\">Visual Capitalist</a></p>\n<p>The Wall Street Journal again named Microsoft its <a href=\"https://www.wsj.com/articles/microsoft-best-managed-companies-2022-11670630632?mod=Searchresults_pos10&amp;page=1\">top-managed firm</a>.</p>\n<p>How does it do this?</p>\n<ul>\n<li>Microsoft doesn&rsquo;t have the biggest cloud business (Amazon Web Services) but they are #2 in market share.</li>\n<li>It isn&rsquo;t Facebook or Instagram, but Microsoft owns LinkedIn.</li>\n<li>Its Xbox is #2 behind Playstation in gaming consoles.</li>\n<li>Now, Microsoft is moving into video gaming content with its proposed Activision Blizzard acquisition.</li>\n</ul>\n<p>Of course, a fast-follower strategy doesn&rsquo;t work in every situation.</p>\n<p>Have you &ldquo;Binged&rdquo; anything online lately? Where is your Zune player? Some misses are inevitable.</p>\n<p>But&hellip;a lot of 2nd place finishes, when added up, make for staggering and consistent success.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"translated-to-investing\">Translated to Investing</h2>\n<p>Fast Follow Investing aims to do the same thing:</p>\n<ul>\n<li>Find the trend that is working, buy into it, and grow with it.</li>\n<li>When the trend becomes unfavorable, get out.</li>\n</ul>\n<p>A <a href=\"https://fastfollowinvestor.com/\">FastFollowInvestor.com</a> portfolio is never the flashy 1st place finisher.</p>\n<p>In fact, it will likely NEVER have the highest return in a given year.</p>\n<p>Though stack up many high-place finishes year after year (especially in down years), and you become the winner.</p>\n<p>The <a href=\"https://fastfollowinvestor.com/\">FastFollowInvestor.com</a> portfolio will be the highest performer over 5 years.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"lets-make-this-fun\">Let&rsquo;s Make This Fun</h2>\n<p>My second reason for the name is that Fast Follow Investor simply sounds better!</p>\n<p>It&rsquo;s a catchier name than &ldquo;Tactical Asset Allocation&rdquo; or &ldquo;TAA&rdquo; (or &ldquo;T&amp;A&rdquo; as it&rsquo;s often misheard.)</p>\n<p>In my view, the strategy needs better marketing.</p>\n<p>TAA is THE best strategy out there for investment success over the long haul.</p>\n<p>Hands down.</p>\n<p>But nobody knows about it! And this needs to change.</p>\n<p>So maybe a little rebranding will help.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"and-that-cute-dog\">And That Cute Dog</h2>\n<p>Now, for my beloved mascot. The dog featured everywhere is my pup Izzie.</p>\n<p>She follows me everywhere.</p>\n<p>I think it has to do with her hearing loss in old age. For fear of being left behind, Izzie follows me all around my house. Upstairs. Downstairs. Inside. Outside.</p>\n<p>Izzie puts a lot of trust in me to guide her.</p>\n<p>And I know those who follow me do as well.</p>\n<p>My wife and I have had Izzie since 2007. She&rsquo;s almost 15 1/2 years old. :-(</p>\n<p>As my mascot, Izzie gets to stay with us a lot longer.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p><a href=\"https://fastfollowinvestor.com/subscribe/\">Subscribe</a> to get my posts sent to your Inbox.</p>\n",
				"content_text": "_If you're curious, here's my thinking about the name and logo (or should I say mascot)._\n<br>\n<br>\n\n<img src=\"https://fastfollowinvestor.com/uploads/2022/ab3c730aac.jpg\" width=\"512\" height=\"683\" alt=\"\" />\n<br>\n<br>\n\n## Fast Follower Technology\n\nThe \"fast follower\" in the name stems from the technology strategy.  \n\nA fast follower is not an innovator. \n\nBut when innovation takes off, the fast follower quickly jumps in.\n\nThe master of this is Microsoft. Its success speaks for itself. \n\nMicrosoft has been in the top 3 in market capitalization for over 20 years.\n\nNo other company can match it.\n<br>\n<br>\n\n<img src=\"https://fastfollowinvestor.com/uploads/2022/88966d96a5.png\" width=\"600\" height=\"675\" alt=\"\" />\n\nCredit [Visual Capitalist](https://www.visualcapitalist.com/cp/largest-companies-from-2000-to-2022/)\n\nThe Wall Street Journal again named Microsoft its [top-managed firm](https://www.wsj.com/articles/microsoft-best-managed-companies-2022-11670630632?mod=Searchresults_pos10&page=1). \n\nHow does it do this?\n\n* Microsoft doesn't have the biggest cloud business (Amazon Web Services) but they are #2 in market share.\n* It isn't Facebook or Instagram, but Microsoft owns LinkedIn.\n* Its Xbox is #2 behind Playstation in gaming consoles.\n* Now, Microsoft is moving into video gaming content with its proposed Activision Blizzard acquisition.\n\nOf course, a fast-follower strategy doesn't work in every situation. \n\nHave you \"Binged\" anything online lately? Where is your Zune player? Some misses are inevitable.\n\nBut...a lot of 2nd place finishes, when added up, make for staggering and consistent success.\n<br>\n<br>\n\n## Translated to Investing \n\nFast Follow Investing aims to do the same thing: \n\n* Find the trend that is working, buy into it, and grow with it. \n* When the trend becomes unfavorable, get out.\n\nA [FastFollowInvestor.com](https://fastfollowinvestor.com/) portfolio is never the flashy 1st place finisher. \n\nIn fact, it will likely NEVER have the highest return in a given year.\n\nThough stack up many high-place finishes year after year (especially in down years), and you become the winner. \n\nThe [FastFollowInvestor.com](https://fastfollowinvestor.com/) portfolio will be the highest performer over 5 years.\n<br>\n<br>\n\n## Let's Make This Fun\n\nMy second reason for the name is that Fast Follow Investor simply sounds better! \n\nIt's a catchier name than \"Tactical Asset Allocation\" or \"TAA\" (or \"T&A\" as it's often misheard.) \n\nIn my view, the strategy needs better marketing. \n\nTAA is THE best strategy out there for investment success over the long haul. \n\nHands down. \n\nBut nobody knows about it! And this needs to change. \n\nSo maybe a little rebranding will help.\n<br>\n<br>\n\n## And That Cute Dog\n\nNow, for my beloved mascot. The dog featured everywhere is my pup Izzie.\n\nShe follows me everywhere. \n\nI think it has to do with her hearing loss in old age. For fear of being left behind, Izzie follows me all around my house. Upstairs. Downstairs. Inside. Outside.\n\nIzzie puts a lot of trust in me to guide her.\n\nAnd I know those who follow me do as well.\n\nMy wife and I have had Izzie since 2007. She's almost 15 1/2 years old. :-(\n\nAs my mascot, Izzie gets to stay with us a lot longer. \n<br>\n<br>\n\n[Subscribe](https://fastfollowinvestor.com/subscribe/) to get my posts sent to your Inbox.\n",
				"date_published": "2022-12-12T19:36:10-08:00",
				"url": "https://fastfollowinvestor.com/2022/12/12/what-is-behind.html",
				"tags": ["on life","money and markets"]
			},
			{
				"id": "http://brianh.micro.blog/2022/12/01/my-dec-portfolio.html",
				"title": "My Dec 2022 portfolio: international stocks, commodities, and gold!",
				"content_html": "<!-- raw HTML omitted -->\n<p>This month’s trades are in!</p>\n<p>On December 1, my Fast Follow Investor model made some big moves:</p>\n<!-- raw HTML omitted -->\n<h2 id=\"december-2022-allocations\">December 2022 Allocations</h2>\n<ul>\n<li>~50% International equities (tickers SCZ, EFA, VGK)</li>\n<li>~25% Gold and commodities (tickers GLD, DBC)</li>\n<li>~25% Cash</li>\n</ul>\n<!-- raw HTML omitted -->\n<blockquote>\n<p>&ldquo;When it comes time to buy and it&rsquo;s the right time, you will not want to.\nWhen it comes time to sell and it&rsquo;s the right time, you will not want to.&rdquo;</p>\n</blockquote>\n<p>Remember: Just like Buy &amp; Hold, Fast Follow trend investing requires fortitude to stick with it.</p>\n<p>One last point:\nNotice that last decade&rsquo;s top performers are completely absent: US equities and big tech! Has the tide turned? Only time will tell&hellip;</p>\n<p>If you know others who might learn from my monthly investments or commentary, please direct them to <a href=\"https://fastfollowinvestor.com/\">fastfollowinvestor.com</a>.</p>\n<p>Thanks!</p>\n<!-- raw HTML omitted -->\n<p>This offer is in no way financial advice. Rather, it is very important financial education!\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p><a href=\"https://fastfollowinvestor.com/subscribe/\">Subscribe</a> to get my posts sent to your Inbox.</p>\n",
				"content_text": "<img src=\"https://fastfollowinvestor.com/uploads/2022/41b62603f7.gif\" width=\"600\" height=\"200\" alt=\"\" />\n\nThis month’s trades are in!\n\nOn December 1, my Fast Follow Investor model made some big moves:\n\n<br>\n\n## December 2022 Allocations\n\n* ~50% International equities (tickers SCZ, EFA, VGK)\n* ~25% Gold and commodities (tickers GLD, DBC)\n* ~25% Cash\n\n<br>\nMy head and my heart tell me this is a precarious time to \"get back in\". But the market and the model disagree.\n\n> \"When it comes time to buy and it's the right time, you will not want to.\nWhen it comes time to sell and it's the right time, you will not want to.\"\n\nRemember: Just like Buy & Hold, Fast Follow trend investing requires fortitude to stick with it. \n\nOne last point: \nNotice that last decade's top performers are completely absent: US equities and big tech! Has the tide turned? Only time will tell...\n\nIf you know others who might learn from my monthly investments or commentary, please direct them to [fastfollowinvestor.com](https://fastfollowinvestor.com/).\n\nThanks!\n\n<br>\n\nThis offer is in no way financial advice. Rather, it is very important financial education!\n<br>\n<br>\n\n[Subscribe](https://fastfollowinvestor.com/subscribe/) to get my posts sent to your Inbox.\n",
				"date_published": "2022-12-09T14:51:09-08:00",
				"url": "https://fastfollowinvestor.com/2022/12/01/my-dec-portfolio.html",
				"tags": ["money and markets"]
			},
			{
				"id": "http://brianh.micro.blog/2022/11/23/the-rule-of.html",
				"title": "The Rule of 72 and the Power of the Double (aka Compounding)",
				"content_html": "<p><em>Use these quick calculations to determine your savings at a future date&hellip;</em></p>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<p>You can put away your spreadsheet(s). :-) Instead, jot down your:</p>\n<ul>\n<li>Existing savings balance</li>\n<li>Investment rate of return (expected)</li>\n<li>Long-term inflation rate (estimated)</li>\n<li>#years your savings can grow</li>\n</ul>\n<p>In this post, I&rsquo;ll walk you through an example.</p>\n<p>In doing so, I&rsquo;ll introduce you to the <strong>Rule of 72</strong>, how to calculate <strong>real rate of return</strong>, how <strong>doubling</strong> simplifies the compounding calculation and <strong>sensitivity analysis</strong> (as a bonus).</p>\n<p>We&rsquo;ll use these values:</p>\n<ul>\n<li>Existing savings: $1.75M</li>\n<li>Investment rate of return: 12%</li>\n<li>Inflation rate: 4%</li>\n<li>#years to grow: 45 years\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></li>\n</ul>\n<h2 id=\"the-rule-of-72\">The Rule of 72</h2>\n<blockquote>\n<p>The Rule of 72 is a &ldquo;back of the envelope&rdquo; approximation used to estimate the years required to double an amount of money at a given rate of return.</p>\n</blockquote>\n<p>The rule: 72 / &ldquo;rate of return&rdquo; = &ldquo;# years to double&rdquo;.</p>\n<p>Using my #s: 72 / 12 = 6 years to double.</p>\n<p>That sounds great. But six years isn&rsquo;t realistic.</p>\n<p>We need to adjust the 12% rate, which is a nominal rate.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"calculating-real-rate-of-return\">Calculating Real Rate of Return</h2>\n<blockquote>\n<p>The real rate of return is the annual percentage of profit earned on an investment, adjusted for inflation. The real return rate indicates money&rsquo;s actual purchasing power over time.</p>\n</blockquote>\n<p>Nominal means that a dollar now is worth a dollar later (years later)&hellip;</p>\n<p>Given the inflation of late, we can understand why this isn&rsquo;t realistic. A dollar six years from now won&rsquo;t buy as much.</p>\n<p>So, to account for inflation, we need to use the &ldquo;real&rdquo; rate of return. We take the &ldquo;rate of return&rdquo; from above and subtract the inflation rate.</p>\n<p>For nearly 40 years, inflation hovered near 2%. Right now, it is around 8%.</p>\n<p>Many experts believe it will settle around 4% over the long term.</p>\n<p>72 / (12 nominal rate - 4 inflation rate) or\n72 / 8 = 9 years to double.</p>\n<p>Therefore&hellip;</p>\n<p>The Tactical Asset Allocation (TAA) model I follow doubles my money <em>in real purchasing power</em> every 9 years, assuming a 4% inflation rate.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"power-of-the-double\">Power of the Double</h2>\n<blockquote>\n<p>The compounded return is the rate of return of an investment over a cumulative series of time. Doubling is a single case of the compound return equation:  An initial investment is multiplied by 2 raised to the power of the number of doubles. Such as: $1,000 investment x (2)^5 doubles.</p>\n</blockquote>\n<p>I&rsquo;m 46 years old, almost 47. I&rsquo;m also an optimist and expect to live to at least 92.</p>\n<p>In that case, I expect to get another:</p>\n<p>92 - 47 = 45 years of life.</p>\n<p>45 / 9 years to double = 5 more doubles.</p>\n<p>Starting with savings of $1.75M:</p>\n<p>$1.75M x 2 x 2 x 2 x 2 x 2 = $56M in real terms, at age 92.</p>\n<p>I&rsquo;ll take it.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"pressure-testing-the-outcome\">Pressure-Testing the Outcome</h2>\n<blockquote>\n<p>Sensitivity analysis determines how different values of an independent variable affect a particular dependent variable under a given set of assumptions.</p>\n</blockquote>\n<p>In this case, I&rsquo;ll vary the real rate of return to see its impact on my savings growth.</p>\n<p>But first&hellip;</p>\n<p>What is absolutely necessary to make the $56M outcome possible?</p>\n<ul>\n<li>I need at least a 12% annual return (nominal). This is where my Fast Follow Investor.com TAA strategy comes in.</li>\n<li>I need at most a 4% long-term inflation rate. I must count on the Federal Reserve to help control this!</li>\n</ul>\n<p>What happens if my 8% real return drops to 6%?</p>\n<p>Perhaps my nominal return comes in at 11% with a long-term inflation rate of 5% (11-5 = 6).</p>\n<p>Adjusting the real return from 8% to 6% increases a 9-year double to a 12-year double.</p>\n<p>45 / 12 = 3.75 doubles.</p>\n<p>3.75 doubles reduce my savings at age 92 from $56M to $23.5M.</p>\n<p>It&rsquo;s certainly less, but I&rsquo;ll still take it.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<h2 id=\"so-in-summary\">So, in Summary</h2>\n<ul>\n<li>Investment return minus inflation rate = real return</li>\n<li>72 / real return = # years to double</li>\n<li>Remaining years of life / # years to double = # of doubles</li>\n<li>Existing savings x 2^(# of doubles) gives you your savings target, in real dollars</li>\n</ul>\n<p>Knowing your # of doubles keeps those spreadsheets at bay!\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>Thank you for supporting Fast Follow Investor.com.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p><a href=\"https://fastfollowinvestor.com/subscribe/\">Subscribe</a> to get my posts sent to your Inbox.</p>\n",
				"content_text": "_Use these quick calculations to determine your savings at a future date..._\n\n<img src=\"https://fastfollowinvestor.com/uploads/2022/4299d1c610.png\" width=\"512\" height=\"512\" alt=\"\" />\n\n<br>\n\nYou can put away your spreadsheet(s). :-) Instead, jot down your:\n\n* Existing savings balance\n* Investment rate of return (expected)\n* Long-term inflation rate (estimated)\n* #years your savings can grow\n\nIn this post, I'll walk you through an example.\n\nIn doing so, I'll introduce you to the **Rule of 72**, how to calculate **real rate of return**, how **doubling** simplifies the compounding calculation and **sensitivity analysis** (as a bonus).\n\nWe'll use these values:\n\n* Existing savings: $1.75M\n* Investment rate of return: 12% \n* Inflation rate: 4% \n* #years to grow: 45 years \n<br>\n<br>\n\n## The Rule of 72\n\n> The Rule of 72 is a \"back of the envelope\" approximation used to estimate the years required to double an amount of money at a given rate of return.\n\nThe rule: 72 / \"rate of return\" = \"# years to double\".\n\nUsing my #s: 72 / 12 = 6 years to double.  \n\nThat sounds great. But six years isn't realistic.\n\nWe need to adjust the 12% rate, which is a nominal rate.\n<br>\n<br>\n\n## Calculating Real Rate of Return\n \n> The real rate of return is the annual percentage of profit earned on an investment, adjusted for inflation. The real return rate indicates money's actual purchasing power over time.\n\nNominal means that a dollar now is worth a dollar later (years later)...\n\nGiven the inflation of late, we can understand why this isn't realistic. A dollar six years from now won't buy as much.\n\nSo, to account for inflation, we need to use the \"real\" rate of return. We take the \"rate of return\" from above and subtract the inflation rate.\n\nFor nearly 40 years, inflation hovered near 2%. Right now, it is around 8%. \n\nMany experts believe it will settle around 4% over the long term.\n\n72 / (12 nominal rate - 4 inflation rate) or\n72 / 8 = 9 years to double.\n\nTherefore...\n\nThe Tactical Asset Allocation (TAA) model I follow doubles my money *in real purchasing power* every 9 years, assuming a 4% inflation rate.\n<br>\n<br>\n\n## Power of the Double\n\n> The compounded return is the rate of return of an investment over a cumulative series of time. Doubling is a single case of the compound return equation:  An initial investment is multiplied by 2 raised to the power of the number of doubles. Such as: $1,000 investment x (2)^5 doubles. \n\nI'm 46 years old, almost 47. I'm also an optimist and expect to live to at least 92.\n\nIn that case, I expect to get another:\n\n92 - 47 = 45 years of life.\n\n45 / 9 years to double = 5 more doubles.\n\nStarting with savings of $1.75M:\n\n$1.75M x 2 x 2 x 2 x 2 x 2 = $56M in real terms, at age 92.\n\nI'll take it.\n<br>\n<br>\n\n## Pressure-Testing the Outcome\n \n> Sensitivity analysis determines how different values of an independent variable affect a particular dependent variable under a given set of assumptions.\n\nIn this case, I'll vary the real rate of return to see its impact on my savings growth.\n\nBut first...\n\nWhat is absolutely necessary to make the $56M outcome possible?\n\n* I need at least a 12% annual return (nominal). This is where my Fast Follow Investor.com TAA strategy comes in.\n* I need at most a 4% long-term inflation rate. I must count on the Federal Reserve to help control this!\n\nWhat happens if my 8% real return drops to 6%? \n\nPerhaps my nominal return comes in at 11% with a long-term inflation rate of 5% (11-5 = 6).\n\nAdjusting the real return from 8% to 6% increases a 9-year double to a 12-year double.\n\n45 / 12 = 3.75 doubles.\n\n3.75 doubles reduce my savings at age 92 from $56M to $23.5M.\n\nIt's certainly less, but I'll still take it.\n<br>\n<br>\n\n## So, in Summary\n\n* Investment return minus inflation rate = real return\n* 72 / real return = # years to double\n* Remaining years of life / # years to double = # of doubles\n* Existing savings x 2^(# of doubles) gives you your savings target, in real dollars\n\nKnowing your # of doubles keeps those spreadsheets at bay!\n<br>\n<br>\n\nThank you for supporting Fast Follow Investor.com.\n<br>\n<br>\n\n[Subscribe](https://fastfollowinvestor.com/subscribe/) to get my posts sent to your Inbox.\n",
				"date_published": "2022-12-01T10:52:23-08:00",
				"url": "https://fastfollowinvestor.com/2022/11/23/the-rule-of.html",
				"tags": ["money and markets"]
			},
			{
				"id": "http://brianh.micro.blog/2022/11/17/testing.html",
				"title": "SBF and FTX collapse. The truth is most assuredly messy.",
				"content_html": "<!-- raw HTML omitted -->\n<p>Like many of you, I am fascinated by the collapse of FTX and its founder, Sam Bankman-Fried. The juicy details will make for a great Netflix series.</p>\n<p>But, beyond the high-profile storylines, I have been thinking a lot about how everyone missed this&hellip; including me. Why did I miss this?</p>\n<p>I have watched crypto from the sidelines for the last 3 years, often thinking I had missed out.</p>\n<p>To console myself, I read about the sketchy characters, the crypto bros, and the money laundering. That&rsquo;s why I&rsquo;m not in this.</p>\n<p>But I couldn&rsquo;t ignore Sam Bankman-Fried.</p>\n<p>He came from traditional finance. He was smart. He (seemingly) supported regulation. He was relatable&hellip;a normal guy. He kept me interested enough to think crypto might be for me.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>It is human nature to get wrapped up in a one-sided story.</p>\n<p>Up until Sunday, Nov 6 these are the headlines associated with Sam.</p>\n<ul>\n<li>The next Warren Buffett? <em>Fortune</em></li>\n<li>The mogul who mastered Washington. <em>Forbes</em></li>\n<li>The JP Morgan of crypto. <em>Jim Cramer</em></li>\n</ul>\n<!-- raw HTML omitted -->\n<p>And, since Nov 6, he is:</p>\n<ul>\n<li>The Bernie Madoff of crypto</li>\n<li>Sam Bankman-Fraud</li>\n</ul>\n<p>The negative articles are coming fast and furious.</p>\n<p>Here is one:\n<a href=\"https://nymag.com/intelligencer/2022/11/5-more-disturbing-revelations-about-sam-bankman-fried.html\">8 More Disturbing Revelations About Sam Bankman-Fried</a>\n<em>By Kevin T. Dugan and Matt Stieb</em><br>\n<!-- raw HTML omitted --></p>\n<p>We love heroes, and we love villains.</p>\n<p>But, I have to remind myself: the truth exists somewhere in the middle. It always does.</p>\n<p>Life is messy.\n<!-- raw HTML omitted --></p>\n<blockquote>\n<p><strong>“If you only hear one side of the story, you have no understanding at all.”</strong><br>\n— Chinua Achebe\n<!-- raw HTML omitted --></p>\n</blockquote>\n<p>I will try to apply this lesson to my own beliefs.</p>\n<ul>\n<li>Seek out counter-arguments</li>\n<li>Assess both sides of the story</li>\n<li>Only then make my judgment</li>\n<li>Find my truths (not blindly adhering to the tribe&rsquo;s truths)\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></li>\n</ul>\n<p><strong>A related note about Tactical Asset Allocation (TAA)</strong></p>\n<p>This is new. Be open-minded. It will conflict with certain investment beliefs that you may hold.</p>\n<p>But also be critical. TAA cannot erase investment risk. The 60/40 buy &amp; hold portfolio doesn&rsquo;t work in inflationary times. TAA falters when markets whipsaw or experience steep intramonth declines.</p>\n<p>The result of learning more?</p>\n<ul>\n<li>At best, I’ll open your mind to a new investing strategy.</li>\n<li>At worst, you’ll consider my evidence and it will further validate your existing strategies.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></li>\n</ul>\n<p>Thank you for reading. And for supporting FastFollowInvestor.com.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p><a href=\"https://fastfollowinvestor.com/subscribe/\">Subscribe</a> to get my posts sent to your Inbox.</p>\n",
				"content_text": "<img src=\"uploads/2022/d9a2b65d1a.jpg\" width=\"600\" height=\"337\" alt=\"\">\n\nLike many of you, I am fascinated by the collapse of FTX and its founder, Sam Bankman-Fried. The juicy details will make for a great Netflix series.\n\nBut, beyond the high-profile storylines, I have been thinking a lot about how everyone missed this... including me. Why did I miss this? \n\nI have watched crypto from the sidelines for the last 3 years, often thinking I had missed out.\n\nTo console myself, I read about the sketchy characters, the crypto bros, and the money laundering. That's why I'm not in this.\n\nBut I couldn't ignore Sam Bankman-Fried. \n\nHe came from traditional finance. He was smart. He (seemingly) supported regulation. He was relatable...a normal guy. He kept me interested enough to think crypto might be for me.\n<br>\n<br>\n\n\nIt is human nature to get wrapped up in a one-sided story.\n\nUp until Sunday, Nov 6 these are the headlines associated with Sam. \n\n* The next Warren Buffett? _Fortune_\n* The mogul who mastered Washington. _Forbes_\n* The JP Morgan of crypto. _Jim Cramer_\n\n\n<img src=\"uploads/2022/7d04511e2e.png\" width=\"600\" height=\"389\" alt=\"\" />\n\n\nAnd, since Nov 6, he is:\n\n* The Bernie Madoff of crypto\n* Sam Bankman-Fraud\n\n\nThe negative articles are coming fast and furious. \n\nHere is one:\n[8 More Disturbing Revelations About Sam Bankman-Fried](https://nymag.com/intelligencer/2022/11/5-more-disturbing-revelations-about-sam-bankman-fried.html)\n_By Kevin T. Dugan and Matt Stieb_  \n<br>\n\nWe love heroes, and we love villains.\n\nBut, I have to remind myself: the truth exists somewhere in the middle. It always does.\n\nLife is messy.\n<br>\n\n\n> **“If you only hear one side of the story, you have no understanding at all.”**   \n> — Chinua Achebe\n<br>\n\n\nI will try to apply this lesson to my own beliefs.\n\n* Seek out counter-arguments\n* Assess both sides of the story\n* Only then make my judgment\n* Find my truths (not blindly adhering to the tribe's truths)\n <br>\n <br>\n \n\n**A related note about Tactical Asset Allocation (TAA)**\n\nThis is new. Be open-minded. It will conflict with certain investment beliefs that you may hold.\n\nBut also be critical. TAA cannot erase investment risk. The 60/40 buy & hold portfolio doesn't work in inflationary times. TAA falters when markets whipsaw or experience steep intramonth declines.\n\nThe result of learning more?\n\n* At best, I’ll open your mind to a new investing strategy.\n* At worst, you’ll consider my evidence and it will further validate your existing strategies. \n<br>\n<br>\n\n\nThank you for reading. And for supporting FastFollowInvestor.com.\n<br>\n<br>\n\n[Subscribe](https://fastfollowinvestor.com/subscribe/) to get my posts sent to your Inbox.\n",
				"date_published": "2022-11-23T21:12:02-08:00",
				"url": "https://fastfollowinvestor.com/2022/11/17/testing.html",
				"tags": ["money and markets"]
			},
			{
				"id": "http://brianh.micro.blog/2022/11/20/becoming-financially-independent.html",
				"title": "Becoming financially independent requires you do only two things",
				"content_html": "<p><em>Save. Invest.</em></p>\n<p>It&rsquo;s as easy as that.</p>\n<p>Slightly more complicated:</p>\n<p><em>Save a lot early. Transition to investing well later.</em></p>\n<p>More on that <a href=\"https://www.linkedin.com/posts/brianherriot_money-investments-personalfinance-activity-6998313419539918849-TQ9u?utm_source=share&amp;utm_medium=member_desktop\">here</a>.</p>\n<p>Within saving and investing, there are building blocks:</p>\n<p><strong>The many ways to build wealth</strong>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>There are a lot of great personal finance and investment blogs out there.</p>\n<p>This one serves a specific niche.</p>\n<p>Fast Follow Investor.com teaches Tactical Asset Allocation (TAA).</p>\n<p>As shown above:</p>\n<ul>\n<li>It&rsquo;s on the <em>invest well</em> side of the wealth-building equation&hellip;</li>\n<li>Focusing on <em>financial markets</em>, and&hellip;</li>\n<li>Primarily for individual investors who are buy &amp; holders\n<!-- raw HTML omitted --></li>\n</ul>\n<p>Are you a buy &amp; holder? If yes, you should learn more about TAA!</p>\n<p>You can do that in one of two ways:</p>\n<ul>\n<li>Follow my writing <a href=\"https://fastfollowinvestor.com/subscribe/\">here</a>.</li>\n<li>Sign up to track my personal investments (made monthly) <a href=\"https://fastfollowinvestor.com/invest-like-me/\">here</a>.</li>\n</ul>\n",
				"content_text": "_Save. Invest._\n\nIt's as easy as that.\n\nSlightly more complicated: \n\n_Save a lot early. Transition to investing well later._ \n\nMore on that [here](https://www.linkedin.com/posts/brianherriot_money-investments-personalfinance-activity-6998313419539918849-TQ9u?utm_source=share&utm_medium=member_desktop).\n\nWithin saving and investing, there are building blocks:\n\n\n**The many ways to build wealth**\n<img src=\"https://fastfollowinvestor.com/uploads/2022/21efaddca2.png\" width=\"600\" height=\"323\" alt=\"\" />\n<br>\n<br>\n\nThere are a lot of great personal finance and investment blogs out there.\n\nThis one serves a specific niche. \n\nFast Follow Investor.com teaches Tactical Asset Allocation (TAA). \n\nAs shown above:\n\n* It's on the _invest well_ side of the wealth-building equation...\n* Focusing on _financial markets_, and...\n* Primarily for individual investors who are buy & holders\n<br>\n\n\nAre you a buy & holder? If yes, you should learn more about TAA!\n\nYou can do that in one of two ways:\n\n* Follow my writing [here](https://fastfollowinvestor.com/subscribe/).\n* Sign up to track my personal investments (made monthly) [here](https://fastfollowinvestor.com/invest-like-me/).\n",
				"date_published": "2022-11-23T21:07:47-08:00",
				"url": "https://fastfollowinvestor.com/2022/11/20/becoming-financially-independent.html",
				"tags": ["money and markets"]
			},
			{
				"id": "http://brianh.micro.blog/2022/11/19/the-classic-investment.html",
				"title": "The Classic 60-40 Investment Strategy Falls Apart. ‘There’s No Place to Hide.’",
				"content_html": "<!-- raw HTML omitted -->\n<p>On Nov 13, the Wall Street Journal published</p>\n<p><a href=\"https://www.wsj.com/articles/investment-retirement-stocks-bonds-market-11668015638?mod=Searchresults_pos1&amp;page=1\">The Classic 60-40 Investment Strategy Falls Apart. ‘There’s No Place to Hide.’</a></p>\n<p>(the article may be behind a firewall)</p>\n<p>My 5 takeaways from the article:</p>\n<ol>\n<li>Market losses impact real people. There is a community in this, and you are not alone.</li>\n<li>The article buried the lead: Why isn&rsquo;t 60/40 working? Inflation. What has worked for the last 40 years will likely be different in the future.</li>\n<li>Individual investors need a system beyond 60/40 that can adapt to varying economic conditions, not just a disinflationary one.</li>\n<li>I disagree with blind commitment from financial advisors to stick with 60/40. We can&rsquo;t know the future. Will it be inflationary or recessionary? Or both? Or neither?!</li>\n<li>We are resilient. I would be doing exactly what Johnathan Bowden is doing in his situation. I wish everyone featured in the article good fortune, prosperity, and happiness.</li>\n</ol>\n<p>Inflation hurts everyone.</p>\n<p>And getting it under control must be the Federal Reserve&rsquo;s highest priority.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p><a href=\"https://fastfollowinvestor.com/subscribe/\">Subscribe</a> to get my posts sent to your Inbox.</p>\n",
				"content_text": "<img src=\"uploads/2022/43b47ba96a.png\" width=\"512\" height=\"512\" alt=\"\" />\n\nOn Nov 13, the Wall Street Journal published\n\n[The Classic 60-40 Investment Strategy Falls Apart. ‘There’s No Place to Hide.’](https://www.wsj.com/articles/investment-retirement-stocks-bonds-market-11668015638?mod=Searchresults_pos1&page=1)\n\n(the article may be behind a firewall)\n\nMy 5 takeaways from the article:\n\n1. Market losses impact real people. There is a community in this, and you are not alone.\n2. The article buried the lead: Why isn't 60/40 working? Inflation. What has worked for the last 40 years will likely be different in the future.\n3. Individual investors need a system beyond 60/40 that can adapt to varying economic conditions, not just a disinflationary one.\n4. I disagree with blind commitment from financial advisors to stick with 60/40. We can't know the future. Will it be inflationary or recessionary? Or both? Or neither?!\n5. We are resilient. I would be doing exactly what Johnathan Bowden is doing in his situation. I wish everyone featured in the article good fortune, prosperity, and happiness.\n\n\nInflation hurts everyone.\n\nAnd getting it under control must be the Federal Reserve's highest priority.\n<br>\n<br>\n\n[Subscribe](https://fastfollowinvestor.com/subscribe/) to get my posts sent to your Inbox.\n",
				"date_published": "2022-11-19T10:43:03-08:00",
				"url": "https://fastfollowinvestor.com/2022/11/19/the-classic-investment.html",
				"tags": ["money and markets"]
			},
			{
				"id": "http://brianh.micro.blog/2022/11/08/you-not-the.html",
				"title": "You, not the stock market, should set your retirement date",
				"content_html": "<p><em>Despite popular belief, you need NOT accept market risk.</em>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>Last week I <a href=\"https://fastfollowinvestor.com/2022/10/30/meta-has-crashed.html\">shared</a> that Meta would need to double two times over (grow 300%) to recover from its 75% loss in 2022.</p>\n<p>I have been thinking a lot about how to better convey the sheer tragedy of this fact.</p>\n<p>Imagine that you are two years to retirement.  You&rsquo;re only two years away from &ldquo;hanging it up&rdquo;&hellip; &ldquo;living the good life&rdquo;. You have $2M in savings and are feeling pretty good.</p>\n<p>Then, over the next six months, your investments drops to $500K (75% loss).</p>\n<p>How would you feel?</p>\n<p>I know how I would. Lots of tears. And then back to work.</p>\n<p>Thankfully, you&rsquo;re not dumb enough to put $2M of retirement savings in Facebook stock alone. (Neither am I.)</p>\n<p>Severe losses, though, aren&rsquo;t limited to individual stocks!</p>\n<p>Let&rsquo;s take a look back at some inopportune years to retire:</p>\n<hr>\n<p>2008: The Subprime Mortgage Crisis\nS&amp;P 500 loss: 57%\nTime to recover: 17 months</p>\n<p>2000: The Dotcom Bubble\nNasdaq loss: 77%\nTime to recover: 15 years</p>\n<p>1973: The Oil Crisis and Economic Recession\nMarket loss: 48%\nTime to recover: 21 months</p>\n<p>1929: The Worst Crash in History\nDow loss: 89%\nTime to recover: 25 years.</p>\n<hr>\n<p>Entire markets can drop 50%+. And the road to recovery can vary: from  17 months (when the Fed gets involved) to 25 years (when it does not).</p>\n<p>Significant market drops are normal.</p>\n<p>But accepting market risk is not required.</p>\n<p>Fast Follow investors cut our losses. In doing so, we manage market risk.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p><em>Take control and never utter &ldquo;It&rsquo;s bad timing, I guess. I&rsquo;m heading back to work.&quot;</em>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>I hope that you&rsquo;ve enjoyed my short series on minimizing loss.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>In summary:</p>\n<p>*Entire markets can drop by 50% or more, setting you way back.</p>\n<p>*<a href=\"https://fastfollowinvestor.com/2022/10/30/meta-has-crashed.html\">Investment losses</a> are asymmetric and compound exponentially. Losses take a long time to dig out from.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p><a href=\"https://fastfollowinvestor.com/subscribe/\">Subscribe</a> to get my posts sent to your Inbox.</p>\n",
				"content_text": "_Despite popular belief, you need NOT accept market risk._\n<br>\n<br>\n\n\nLast week I [shared](https://fastfollowinvestor.com/2022/10/30/meta-has-crashed.html) that Meta would need to double two times over (grow 300%) to recover from its 75% loss in 2022.\n\nI have been thinking a lot about how to better convey the sheer tragedy of this fact.\n\nImagine that you are two years to retirement.  You're only two years away from \"hanging it up\"... \"living the good life\". You have $2M in savings and are feeling pretty good.\n\nThen, over the next six months, your investments drops to $500K (75% loss). \n\nHow would you feel? \n\nI know how I would. Lots of tears. And then back to work.\n\nThankfully, you're not dumb enough to put $2M of retirement savings in Facebook stock alone. (Neither am I.) \n\nSevere losses, though, aren't limited to individual stocks!\n\nLet's take a look back at some inopportune years to retire:\n\n-----\n\n2008: The Subprime Mortgage Crisis\nS&P 500 loss: 57%\nTime to recover: 17 months \n\n2000: The Dotcom Bubble\nNasdaq loss: 77% \nTime to recover: 15 years \n\n1973: The Oil Crisis and Economic Recession\nMarket loss: 48% \nTime to recover: 21 months \n\n1929: The Worst Crash in History\nDow loss: 89%\nTime to recover: 25 years.\n\n-----\n\nEntire markets can drop 50%+. And the road to recovery can vary: from  17 months (when the Fed gets involved) to 25 years (when it does not).\n\nSignificant market drops are normal.\n\nBut accepting market risk is not required. \n\nFast Follow investors cut our losses. In doing so, we manage market risk. \n<br>\n<br>\n\n_Take control and never utter \"It's bad timing, I guess. I'm heading back to work.\"_\n<br>\n<br>\n\n \nI hope that you've enjoyed my short series on minimizing loss.\n<br>\n<br>\n\n\nIn summary:\n\n*Entire markets can drop by 50% or more, setting you way back. \n\n*[Investment losses](https://fastfollowinvestor.com/2022/10/30/meta-has-crashed.html) are asymmetric and compound exponentially. Losses take a long time to dig out from. \n<br>\n<br>\n\n[Subscribe](https://fastfollowinvestor.com/subscribe/) to get my posts sent to your Inbox.\n",
				"date_published": "2022-11-08T12:39:30-08:00",
				"url": "https://fastfollowinvestor.com/2022/11/08/you-not-the.html",
				"tags": ["money and markets"]
			},
			{
				"id": "http://brianh.micro.blog/2022/11/01/this-key-nov.html",
				"title": "This key Nov 2022 trade shifts Fast Follow Investors into commodities",
				"content_html": "<p>This month&rsquo;s trades are in!</p>\n<p>In November, my diversified Fast Follower TAA investment model redeployed some cash:</p>\n<ul>\n<li>13.5% was allocated to the DBC Commodities ETF. Let&rsquo;s see how this trade fares given OPEC&rsquo;s decision to restrict oil drilling and Russia&rsquo;s exit from the Ukraine grain deal.</li>\n<li>The model inched into the SPY S&amp;P 500 Index ETF. The S&amp;P gained nearly ~8% in October, but the TAA model isn&rsquo;t convinced we&rsquo;re in a new bull market.</li>\n</ul>\n<h3 id=\"november-2022-allocations\">November 2022 Allocations</h3>\n<!-- raw HTML omitted -->\n<p>If you know others who might learn from my monthly investments or commentary, please direct them to fastfollowinvestor.com</p>\n<p>Thanks!</p>\n<!-- raw HTML omitted -->\n<p>This offer is in no way financial advice. Rather, it is very important financial education!\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p><a href=\"https://fastfollowinvestor.com/subscribe/\">Subscribe</a> to get my posts sent to your Inbox.</p>\n",
				"content_text": "This month's trades are in!\n\nIn November, my diversified Fast Follower TAA investment model redeployed some cash:\n\n* 13.5% was allocated to the DBC Commodities ETF. Let's see how this trade fares given OPEC's decision to restrict oil drilling and Russia's exit from the Ukraine grain deal.\n* The model inched into the SPY S&P 500 Index ETF. The S&P gained nearly ~8% in October, but the TAA model isn't convinced we're in a new bull market. \n\n### November 2022 Allocations\n<img src=\"https://fastfollowinvestor.com/uploads/2022/636de4cfa6.jpg\" width=\"600\" height=\"163\" alt=\"\" />\n\nIf you know others who might learn from my monthly investments or commentary, please direct them to fastfollowinvestor.com\n\nThanks!\n\n<br>\n<br>\n\nThis offer is in no way financial advice. Rather, it is very important financial education!\n<br>\n<br>\n\n[Subscribe](https://fastfollowinvestor.com/subscribe/) to get my posts sent to your Inbox.\n",
				"date_published": "2022-11-01T11:18:38-08:00",
				"url": "https://fastfollowinvestor.com/2022/11/01/this-key-nov.html",
				"tags": ["money and markets"]
			},
			{
				"id": "http://brianh.micro.blog/2022/10/30/meta-has-crashed.html",
				"title": "It will take 14.5 years for some investors to recover their Facebook losses ",
				"content_html": "<p>This year (as of October 27), six companies together have lost one trillion $$ in market capitalization. They are Apple, Microsoft, Alphabet/Google, Amazon, Tesla, and Meta/Facebook.</p>\n<p>Meta has <a href=\"https://twitter.com/bespokeinvest/status/1585743261054152704?s=20&amp;t=G6_paIdH8iMxmk_EsMKrbA\">crashed</a>, losing nearly 75% of its value on the year.</p>\n<!-- raw HTML omitted -->\n<p>Instead of discussing the merits of Facebook&rsquo;s business or how much money it&rsquo;s spending on Second Life 2.0, I&rsquo;d like to highlight the math behind this 75% loss.</p>\n<p>The math behind crashes is brutal.</p>\n<p>When asked what gain is required to recover from a 75% loss, most people will answer a 75% gain.</p>\n<p>Unfortunately, that is not correct. The answer is a <em>300% gain</em>.</p>\n<p>For example, if you lose $75 of an initial $100, you are left with $25. To recover, you must make $75 back (obviously). But, $75 is 3x your (now) $25 investment or a 300% gain.</p>\n<p>Here is another way to look at it:</p>\n<p>You must double your money twice over: turn $25 into $50, and then $50 into $100. Using an estimated 10% stock market return, it will take you <em>14.5 years</em> just to break even.</p>\n<p>Facebook investors who bought on January 1, 2022 and continue to hold have a long road ahead.</p>\n<p>This table shows gains required to recover losses ranging from 5% to 90%. As losses steepen, the pain accelerates.</p>\n<!-- raw HTML omitted -->\n<p>It makes sense why Warren Buffett&rsquo;s two rules of investing are:</p>\n<blockquote>\n<p>&ldquo;<strong>Rule #1</strong>: Never lose money. <strong>Rule #2</strong>: Never forget Rule #1.&rdquo; <!-- raw HTML omitted -->\n-Warren Buffett</p>\n</blockquote>\n<p>Severe losses really set you back.</p>\n<p>It&rsquo;s the math of it!\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p><a href=\"https://fastfollowinvestor.com/subscribe/\">Subscribe</a> to get my posts sent to your Inbox.</p>\n",
				"content_text": "This year (as of October 27), six companies together have lost one trillion $$ in market capitalization. They are Apple, Microsoft, Alphabet/Google, Amazon, Tesla, and Meta/Facebook.\n\nMeta has [crashed](https://twitter.com/bespokeinvest/status/1585743261054152704?s=20&t=G6_paIdH8iMxmk_EsMKrbA), losing nearly 75% of its value on the year.\n\n<img src=\"https://fastfollowinvestor.com/uploads/2022/d9a2693cb6.png\" width=\"524\" height=\"222\" alt=\"\">\n\nInstead of discussing the merits of Facebook's business or how much money it's spending on Second Life 2.0, I'd like to highlight the math behind this 75% loss.\n\nThe math behind crashes is brutal.\n\nWhen asked what gain is required to recover from a 75% loss, most people will answer a 75% gain. \n\nUnfortunately, that is not correct. The answer is a *300% gain*. \n\nFor example, if you lose $75 of an initial $100, you are left with $25. To recover, you must make $75 back (obviously). But, $75 is 3x your (now) $25 investment or a 300% gain.\n\nHere is another way to look at it:\n\nYou must double your money twice over: turn $25 into $50, and then $50 into $100. Using an estimated 10% stock market return, it will take you *14.5 years* just to break even.\n\nFacebook investors who bought on January 1, 2022 and continue to hold have a long road ahead.\n\nThis table shows gains required to recover losses ranging from 5% to 90%. As losses steepen, the pain accelerates.\n\n<img src=\"https://fastfollowinvestor.com/uploads/2022/d5353c8724.jpg\" width=\"411\" height=\"374\" alt=\"\" />\n\n\nIt makes sense why Warren Buffett's two rules of investing are:\n\n> \"**Rule #1**: Never lose money. **Rule #2**: Never forget Rule #1.\" <br>\n> -Warren Buffett\n\nSevere losses really set you back. \n\nIt's the math of it!\n<br>\n<br>\n\n[Subscribe](https://fastfollowinvestor.com/subscribe/) to get my posts sent to your Inbox.\n",
				"date_published": "2022-10-30T19:39:26-08:00",
				"url": "https://fastfollowinvestor.com/2022/10/30/meta-has-crashed.html",
				"tags": ["money and markets"]
			},
			{
				"id": "http://brianh.micro.blog/2022/10/26/how-to-sniff.html",
				"title": "How to sniff out a bad investment deal",
				"content_html": "<p><em>I guess it&rsquo;s better to learn your lesson early in life, when you have less money at stake&hellip;</em>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>In 1985, I was nine years old and joined my dad for a 45-minute drive to an A&amp;W restaurant in a neighboring town.</p>\n<p>The A&amp;W is still there. In fact, I drove through Wautoma, Wisconsin and saw it this summer.</p>\n<p>My dad had a business meeting with a man named Vern Taggatz. While the two men spoke, I wasted time in the restaurant parking lot kicking rocks.</p>\n<p>My dad was a &ldquo;businessman&rdquo;. He worked for Speed Queen, an appliance company, as a middle manager.</p>\n<p>On the side (a side gig!), he and my mom invested in a couple of houses, flipping them. I helped paint. And I stayed out of the way.</p>\n<p>At the A&amp;W, my dad was discussing an opportunity to invest in a new apartment complex in Plover, Wisconsin.</p>\n<p>I thought it was pretty cool.</p>\n<p>Little did I know at the time I was part of something that is now all the rage: a commercial real estate syndication.</p>\n<p>It took about an hour. Finally, the meeting was over.</p>\n<p>On the drive home, I learned that my dad and Vern did the deal.</p>\n<p>Years later, I learned that my dad invested about $20,000.</p>\n<p>Even more years later, I learned that Vern defrauded my father.</p>\n<p>In 1985, several small investors cut checks to Vern Taggatz who ran off with the money.</p>\n<p>Ouch.</p>\n<p>My dad was smart. He is still smart.</p>\n<p>I try to be like him in many ways. Too much, in fact.</p>\n<p>I&rsquo;m in management (management consulting). I&rsquo;m entrepreneurial. I love investing.</p>\n<p>I bought a high-priced, whole life insurance policy right out of college that I did not need nor could afford.</p>\n<p>Double ouch.</p>\n<p>The lesson?</p>\n<p>When presented with an investment opportunity, really question it.</p>\n<ul>\n<li>How exactly does it work?</li>\n<li>Where is the value?</li>\n<li>What is the downside?</li>\n<li>How well do I know this person?</li>\n</ul>\n<p>If the investment opportunity doesn&rsquo;t <em>feel</em> right, it probably isn&rsquo;t!\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p><a href=\"https://fastfollowinvestor.com/subscribe/\">Subscribe</a> to get my posts sent to your Inbox.</p>\n",
				"content_text": "_I guess it's better to learn your lesson early in life, when you have less money at stake..._\n<br>\n<br>\n\nIn 1985, I was nine years old and joined my dad for a 45-minute drive to an A&W restaurant in a neighboring town. \n\nThe A&W is still there. In fact, I drove through Wautoma, Wisconsin and saw it this summer.\n\nMy dad had a business meeting with a man named Vern Taggatz. While the two men spoke, I wasted time in the restaurant parking lot kicking rocks.\n\nMy dad was a \"businessman\". He worked for Speed Queen, an appliance company, as a middle manager.  \n\nOn the side (a side gig!), he and my mom invested in a couple of houses, flipping them. I helped paint. And I stayed out of the way.\n\nAt the A&W, my dad was discussing an opportunity to invest in a new apartment complex in Plover, Wisconsin. \n\nI thought it was pretty cool. \n\nLittle did I know at the time I was part of something that is now all the rage: a commercial real estate syndication.\n\nIt took about an hour. Finally, the meeting was over. \n\nOn the drive home, I learned that my dad and Vern did the deal. \n\nYears later, I learned that my dad invested about $20,000.\n\nEven more years later, I learned that Vern defrauded my father. \n\nIn 1985, several small investors cut checks to Vern Taggatz who ran off with the money.  \n\nOuch.\n\nMy dad was smart. He is still smart. \n\nI try to be like him in many ways. Too much, in fact.\n\nI'm in management (management consulting). I'm entrepreneurial. I love investing. \n\nI bought a high-priced, whole life insurance policy right out of college that I did not need nor could afford.\n\nDouble ouch.\n\nThe lesson?\n\nWhen presented with an investment opportunity, really question it.  \n\n* How exactly does it work?  \n* Where is the value?  \n* What is the downside?   \n* How well do I know this person?  \n\nIf the investment opportunity doesn't _feel_ right, it probably isn't!\n<br>\n<br>\n\n[Subscribe](https://fastfollowinvestor.com/subscribe/) to get my posts sent to your Inbox.\n",
				"date_published": "2022-10-26T20:06:48-08:00",
				"url": "https://fastfollowinvestor.com/2022/10/26/how-to-sniff.html",
				"tags": ["on life","money and markets"]
			},
			{
				"id": "http://brianh.micro.blog/2022/10/26/hello-world.html",
				"title": "Hello world",
				"content_html": "<p>Hello!</p>\n<p>I look forward to meeting everyone as I create a new community of do-it-yourself investors.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>To start, let me introduce myself.</p>\n<p>I&rsquo;m a husband of 20+ years, father of 10+ years, and management consultant/ business owner.</p>\n<p>Born and raised in Wisconsin, I now live in the San Francisco Bay Area.</p>\n<p>I&rsquo;m fascinated with investments and the economy. I have recently become intrigued by purpose and passion.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>Why <a href=\"https://fastfollowinvestor.com/\">fastfollowinvestor.com</a>? That&rsquo;s easy&hellip; I&rsquo;m introducing do-it-yourself investors to a personal investment strategy called <a href=\"https://fastfollowinvestor.com/invest-like-me/\">Tactical Asset Allocation (TAA)</a>.</p>\n<p>TAA generates investment returns for you to achieve financial independence. And it protects against losses so you can sleep well in this wonderful, new stage of life.</p>\n<p>More DIY investors should know about it.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>At <a href=\"https://fastfollowinvestor.com/\">fastfollowinvestor.com</a>, I want my posts to show some personality and prove enjoyable to read.</p>\n<p>If I do it right, we&rsquo;ll also learn together and have fun doing it.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>A little more about me:</p>\n<ol>\n<li>Friends tell me that I&rsquo;m great to watch a comedy with. They laugh at me laughing at the movie.</li>\n<li>A storm in New Orleans flooded my car up to the steering wheel. A total loss.</li>\n<li>You will want to cook dinner for me because every meal I eat is the best meal I&rsquo;ve ever had.</li>\n<li>I love swimming, skiing, and other fun on the lake. My grandparents owned a cabin in Northern Wisconsin, and now my wife and I do too!</li>\n<li>My sister competed in the Miss America pageant!</li>\n<li>My spirit animal is a dog. I&rsquo;m a dependable and trusted companion, and I always live in the present (both good and bad).</li>\n<li>Our terrier, Izzie, is over 15 years old and still escaping from the yard.</li>\n<li>One regret I have in life is not traveling for long periods overseas when I was younger. I want to make up for that soon.</li>\n<li>Life granted me a great many privileges and only in the last several years have I realized it.</li>\n<li>I have been thinking about writing for a long time and now simply must do it. I&rsquo;m very excited to start this adventure with you!\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></li>\n</ol>\n<p>You can receive my posts on money, the economy, and Fast Follow Investing monthly by clicking <a href=\"https://fastfollowinvestor.com/subscribe/\">Subscribe</a>.\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>I can&rsquo;t wait to get to know you better.</p>\n<p>I look forward to hearing your thoughts and feedback! What interests you?</p>\n",
				"content_text": "Hello! \n\nI look forward to meeting everyone as I create a new community of do-it-yourself investors.\n<br>\n<br>\n\nTo start, let me introduce myself.\n\nI'm a husband of 20+ years, father of 10+ years, and management consultant/ business owner.\n\nBorn and raised in Wisconsin, I now live in the San Francisco Bay Area. \n\nI'm fascinated with investments and the economy. I have recently become intrigued by purpose and passion. \n<br>\n<br>\n\nWhy [fastfollowinvestor.com](https://fastfollowinvestor.com/)? That's easy... I'm introducing do-it-yourself investors to a personal investment strategy called [Tactical Asset Allocation (TAA)](https://fastfollowinvestor.com/invest-like-me/). \n\nTAA generates investment returns for you to achieve financial independence. And it protects against losses so you can sleep well in this wonderful, new stage of life.\n\nMore DIY investors should know about it.\n<br>\n<br>\n\nAt [fastfollowinvestor.com](https://fastfollowinvestor.com/), I want my posts to show some personality and prove enjoyable to read.\n \nIf I do it right, we'll also learn together and have fun doing it. \n<br>\n<br>\n\nA little more about me:\n\n1. Friends tell me that I'm great to watch a comedy with. They laugh at me laughing at the movie.\n2. A storm in New Orleans flooded my car up to the steering wheel. A total loss.\n3. You will want to cook dinner for me because every meal I eat is the best meal I've ever had.\n4. I love swimming, skiing, and other fun on the lake. My grandparents owned a cabin in Northern Wisconsin, and now my wife and I do too!\n5. My sister competed in the Miss America pageant!\n6. My spirit animal is a dog. I'm a dependable and trusted companion, and I always live in the present (both good and bad).\n7. Our terrier, Izzie, is over 15 years old and still escaping from the yard.\n8. One regret I have in life is not traveling for long periods overseas when I was younger. I want to make up for that soon.\n9. Life granted me a great many privileges and only in the last several years have I realized it.\n10. I have been thinking about writing for a long time and now simply must do it. I'm very excited to start this adventure with you!\n<br>\n<br>\n\nYou can receive my posts on money, the economy, and Fast Follow Investing monthly by clicking [Subscribe](https://fastfollowinvestor.com/subscribe/). \n<br>\n<br>\n\nI can't wait to get to know you better. \n\nI look forward to hearing your thoughts and feedback! What interests you?\n",
				"date_published": "2022-10-26T11:20:53-08:00",
				"url": "https://fastfollowinvestor.com/2022/10/26/hello-world.html",
				"tags": ["on life"]
			}
	]
}
